{
  "last_modified": "2025-12-05T21:57:55.079777",
  "fetched_at": "2025-12-05T21:57:55.079799",
  "units": {
    "BAPuMa_M2_U1": {
      "airtable_id": "rec2fnuBlCeqG2SsM",
      "title": "Rechtsmethodik",
      "module_id": "BAPuMa_M2",
      "module_record_id": "recf9b5mBog1Zt5da",
      "semester": 1,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- Grundprinzipien von Rechtsordnungen benennen, beschreiben und bewerten,\n- Rechtsnormen anwenden und auslegen,\n- Lücken in der Rechtsordnung erkennen und schließen,\n- Öffentliches und privates Recht unterscheiden,\n- Normen in die Rangordnung der Rechtsquellen einordnen.\n### Methodenkompetenz\n- Rechtsanwendungsmethoden beschreiben und erläutern,\n- juristisch argumentieren,\n- erworbene methodische Kenntnisse auf unbekannte Fälle übertragen.\n### Sozialkompetenz\n- Bürger_innen sowie Kolleg_innen den Vorgang der Rechtsanwendung Schritt für Schritt zu erläutern.\n### Selbstkompetenz\nDie Studierenden\n- sind in der Lage, in rechtlich zweifelhaften Situationen rechtsmethodisch plausible Lösungen zu entwickeln,\n- haben Grundkenntnisse für die Erstellung von Falllösungen und Hausarbeiten erworben.\n",
      "content": "1.  Begriff Recht, Abgrenzung zu anderen Normen\n2.  Grundprinzipien des Rechts\n- Gerechtigkeit\n- Rechtssicherheit\n- Billigkeit\n1.  Einteilung des Rechts in Öffentliches Recht und Privatrecht\n2.  Typen von Rechtsnormen und Subsumtion\n3.  Auslegung\n4.  Rechtsfortbildung\n5.  Rechtsquellen\n6.  Juristische Klausuren und Hausarbeiten\n"
    },
    "BAPuMa_M20P_U2": {
      "airtable_id": "rec3eu2dCyphXQ0Lr",
      "title": "Arbeitsrecht (ArbeitsR)",
      "module_id": "BAPuMa_M20P",
      "module_record_id": "reciiD6VPiR3lg0s4",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Rechtsverhältnisse der im öffentlichen Dienst Beschäftigten überblicken,\n- fallbezogen im rechtlich-strukturierten Rahmen auf dem Gebiet des Rechts der Tarifbeschäftigten der Länder personalrelevante Entscheidungen insbesondere auch unter Anwendung der Grundlagen der Rechtsmethodik (siehe Modul 2 Unit 1) treffen.\n### Methodenkompetenz\n- die wesentlichen Strukturen des Rechts der Tarifbeschäftigten der Länder zu überblicken und zu erläutern,\n- die für den Einzelfall maßgeblichen Vorschriften des Rechts der Tarifbeschäftigen der Länder zu ermitteln, sie ggfs. auszulegen und auf den Einzelfall anzuwenden,\n- die getroffenen Entscheidungen überzeugend zu begründen.\n### Sozialkompetenz\n- das eigene Dienstrechtsumfeld (Arbeitsrecht im Rahmen der Normenpyramide) erkennen,\n- die gegenläufigen Interessen in einem Arbeitsteam auch in ihren außerrechtlichen Implikationen erkennen,\n- Konfliktsituationen in rechtliche Formen (prozeduraler und inhaltlicher Art) fassen und\n- entsprechende  Konfliktlagen  letztlich  rechtlich  zutreffend,  transparent  und  für  die  Betroffenen nachvollziehbar entscheiden.\n### Selbstkompetenz\n- die Methoden und Techniken der Rechtsanwendung auf den Gebieten des Rechts der Tarifbeschäftigten der Länder in ihrer Relevanz zu erkennen und anzuwenden,\n- vorfindliche Rechtsansichten kritisch und methodengerecht zu analysieren, ggfs. zu bestätigen oder begründet und nachvollziehbar zu widerlegen.\n",
      "content": "Vertiefung der arbeitsrechtlichen Themen aus dem Modul 7 Zivilrecht und Personalrecht, Unit 2 und Unit 4; spezielle Problemstellungen\n- Kollektives und individuelles Arbeitsrecht der Tarifbeschäftigten im öffentlichen Dienst der Länder\n- Verfassungsrechtlicher Rahmen des Arbeitsrechts und einfachgesetzliche Ausgestaltung (Koalitionsfreiheit und Arbeitskampf; Gleichbehandlung; Zweispurigkeit des öffentlichen Dienstes; Vorgaben durch Unionsrecht; Rangfolge der Rechtsquellen)\n- Tarifvertragsrecht (TVG, TV-L),\n- Kündigungsschutzgesetz, weitere Schutzgesetze zu Gunsten der Arbeitnehmer\n- Begründung und Ausgestaltung des Arbeitsverhältnisses: Einstellung, Vertragsgestaltung, Eingruppierung, Probezeit; befristete Arbeitsverhältnisse; Haupt- und Nebenpflichten; Rechte; Versetzung, Abordnung, Zuweisung, Personalgestellung\n- Beendigung des Arbeitsverhältnisses, insbesondere ordentliche und außerordentliche Kündigung\n- Rechtsschutz (Arbeitsgerichtsbarkeit)\n- Haftung und Regress\n- Grundzüge der Versorgung: gesetzliche Rentenversicherung\n- Personalvertretungsrecht\n"
    },
    "BAPuMa_M2_U2": {
      "airtable_id": "rec4PivNb7UYeiNSr",
      "title": "Methoden wissenschaftlichen Arbeitens",
      "module_id": "BAPuMa_M2",
      "module_record_id": "recf9b5mBog1Zt5da",
      "semester": 1,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- Anforderungen an wissenschaftliche Recherche und an das wissenschaftliche Schreiben,\n- grundlegende wissenschaftliche und erkenntnistheoretische Prinzipien und\n- Anforderungen an Erhebungs- und Auswertungsmethoden im Überblick.\n### Methodenkompetenz\n- die Eignung von methodologischen und methodischen Ansätzen für ein Forschungsvorhaben einschätzen und\n- die Qualität empirischer Arbeiten grundlegend beurteilen.\n### Sozialkompetenz\n- von ihrer persönlichen Position distanzieren und\n- sich mit verschiedenen (wissenschaftliche) Positionen und Erkenntnissen sachlich auseinandersetzen.\n### Selbstkompetenz\nDie Studierenden\n- erkennen die Notwendigkeit von Unparteilichkeit und Offenheit für andere wissenschaftliche Positionen,\n- anerkennen die Pflichten, die sich aus dem wissenschaftlichen Streben nach Wahrheit ergeben und\n- entwickeln eine von wissenschaftlichen Grundsätzen geprägte professionelle Haltung gegenüber den Gegenständen ihrer Arbeit in Studium und Beruf.\n",
      "content": "- alltägliche und wissenschaftliche Wahrnehmung, Wahrheit, Werturteilsfreiheit und Distanz\n- Recherche und Anforderungen an wissenschaftliches Arbeiten bzw. Schreiben\n- Grundlagen der Wissenschaftsethik\n- Grundlagen der Erkenntnistheorie\n- Einführung in quantitative und qualitative Erhebungsmethoden\n- grundlegende Standards quantitativer Auswertungen (uni- und bivariat)\n- qualitative Inhaltsanalyse\n- Gütekriterien empirischer Forschung\n"
    },
    "BAPuMa_M20S_U3": {
      "airtable_id": "rec4oAbOb9PigMw0b",
      "title": "Diversität im Netz",
      "module_id": "BAPuMa_M20S",
      "module_record_id": "rec3p8EUNSA8AsoFL",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n## Die Studierenden\n- kennen IT-Systeme zur Verwaltung von Sozialleistungen und Prozesse, die noch zu digitalisieren sind,\n- können Anforderungen an Benutzungsoberflächen identifizieren und kommunizierbar spezifizieren,\n- kennen Ausprägungen von Diversität und können daraus resultierende spezielle Anforderungen an IT-Systeme identifizieren und kommunizieren,\n- kennen Werkzeuge und Methoden zur Konzeption und Erstellung von Internetauftritten.\n### Methodenkompetenz\n## Die Studierenden\n- kennen Beschreibungswerkzeuge und Prozessmodelle zur Digitalisierung von Verwaltungsprozessen - insbesondere im Hinblick auf Diversität und unterschiedliche Anforderungen aus einem heterogenen Nutzerkreis,\n- kennen Methoden des Web-Publishing und sind in der Lage Content Management Systeme einzusetzen,\n- können Methoden der Qualitätssicherung mit besonderer Berücksichtigung diverser Nutzeranforderungen einsetzen.\n### Sozialkompetenz\n- besonders umfangreiche - neben kommunikativer Spezialisierung aber insbesondere die Fähigkeit, soziale Benachteiligungen mit Bezug zu Anforderungen an die IT zu erfassen, zu beschreiben und zu Lösungen beizutragen.\n### Selbstkompetenz\n- besondere Offenheit für spezielle Hilfsbedürftigkeit / Benachteiligungen und Interesse an neuen Techniken / Methoden / Prozesse und Abläufe so zu entwickeln, dass bisher nicht genutzte Praktiken / Aspekte auch zur Unterstützung von Personen nutzbar werden.\n",
      "content": "## Sozialwissenschaftlich:\n- Ausprägungen von Diversität\n- Analyse der Hamburger Bevölkerungsstruktur in Hinblick auf Diversität\n- Barrierefreiheit: Anforderungen, Richtlinien, Umsetzung\n- Diversitätssensible Mediensprache und Bildsprache\n"
    },
    "BAPuMa_M16_U2": {
      "airtable_id": "rec5POxrJnCXRtGub",
      "title": "Besonderes Verwaltungsrecht I Gefahrenabwehrrecht",
      "module_id": "BAPuMa_M16",
      "module_record_id": "receirLz0E0zoTzxX",
      "semester": 4,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Grundzüge und zentralen Begriffe des Hamburgischen Sicherheits- und Ordnungsgesetzes,\n- die wesentlichen Normen des Bauordnungs- und Bauplanungsrechts.\n### Methodenkompetenz\n- mittelschwere verwaltungsrechtliche Fälle aus den genannten Rechts-gebieten unter Heranziehung der einschlägigen Vorschriften zu lösen.\n### Sozialkompetenz\n- Fragen der Bürger\\*innen zu Eingriffsmaßnahmen nach dem hamburgischen Gefahrenabwehrund Bauordnungsrecht beantworten,\n- sich schnell vertieft in die genannten Rechtsgebiete einarbeiten.\n### Selbstkompetenz\n- einen auf die polizeiliche Generalklausel gestützten Verwaltungsakt erlassen,\n- die Rechtmäßigkeit von Eingriffsmaßnahmen nach der Hamburgischen Bauordnung beurteilen,\n- die Verbindungen zwischen Bauplanungs- und Bauordungsrecht erklären.\n",
      "content": ""
    },
    "BAPuMa_M1_U3": {
      "airtable_id": "rec5W0Ao6BAQhtdc3",
      "title": "Personalpsychologie I",
      "module_id": "BAPuMa_M1",
      "module_record_id": "recuZwpfs5f4QZRyW",
      "semester": 1,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- kennen motivierende und demotivierende Faktoren und Arbeitsbedingungen,\n- erkennen organisationale Bedingungen als Belastungen und Stress auslösende Faktoren und\n- kennen Grundlagen sozialwissenschaftlicher Kommunikationstheorien und\n- kennen grundlegende Ansätze zur Erklärung (beruflicher) Konflikte.\n### Methodenkompetenz\nDie Studierenden\n- können Arbeitsbedingungen so gestalten, dass Demotivation, Stress und Belastung reduziert oder vermieden werden.\n### Sozialkompetenz\nDie Studierenden\n- können im beruflichen Kontext so kommunizieren und kooperieren, dass sie zur Lösung oder Vermeidung von Konflikten beitragen können.\n### Selbstkompetenz\nDie Studierenden\n- können Handeln im beruflichen Kontext vor dem Hintergrund der behandelten Theorien und Ansätze reflektieren und\n- können ihr eigenes Handeln entsprechend gestalten.\n",
      "content": "- Arbeitsmotivation\n- Berufsstress und Arbeitsbelastungen\n- Kommunikation und Konflikte\n"
    },
    "BAPuMa_M9_U1": {
      "airtable_id": "rec6RtBXXyPfDAuqm",
      "title": "",
      "module_id": "BAPuMa_M9",
      "module_record_id": "rec3sQTsc1Dlo1K21",
      "semester": "",
      "sws": "",
      "workload": "",
      "lehrsprache": "",
      "learning_outcomes_text": "",
      "content": ""
    },
    "BAPuMa_M17_U1": {
      "airtable_id": "rec8RxQXCXPT7rrTr",
      "title": "Gestaltung organisatorischer Strukturen",
      "module_id": "BAPuMa_M17",
      "module_record_id": "recE2Lk1bI86jcroJ",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Methodenkompetenz\n- alternative Modelle organisatorischer Gestaltung in der Praxis bewerten,\n- in der Praxis an Organisationsuntersuchungen mitwirken und organisatorische Strukturen zielorientiert und situationsadäquat mitgestalten.\n### Sozialkompetenz\n- durch Kommunikation und Kooperation ein Verständnis für organisatorische Veränderungsbedarfe schaffen und Lösungsansätze der Organisationsgestaltung vermitteln.\n### Selbstkompetenz\nDie Studierenden entwickeln\n- ein professionelles Verständnis der kontinuierlichen Weiterentwicklung organisatorischer Strukturen im Kontext sich wandelnder Arbeits- und Umweltbedingungen.\n- Sensibilität für die Bewältigung organisatorischer Veränderungen.\n",
      "content": "- Institutionenökonomische und ressourcenbezogene Theorieansätze und deren Bedeutung für die organisatorische Gestaltung\n- Ziele organisatorischer Gestaltung und organisatorische Gestaltungsparameter\n- Alternativen der Organisation öffentlicher Aufgabenwahrnehmung (Agentur-Modelle, In/Outsourcing, Privatisierung, Kooperationsmodelle)\n- Gestaltung organisatorischer Strukturen: Modelle organisatorischer Differenzierung (Arbeitsteilung)\n- Gestaltung organisatorischer Strukturen: Modelle und Instrumente der organisatorischen Integration (Koordination)\n- Ausgewählte organisatorische Strukturmodelle\n"
    },
    "BAEGov_M1_U1": {
      "airtable_id": "rec9qYyJsrgI6Xx3Q",
      "title": "",
      "module_id": "BAEGov_M1",
      "module_record_id": "recPy8KdlgMFTKv5K",
      "semester": "",
      "sws": "",
      "workload": "",
      "lehrsprache": "",
      "learning_outcomes_text": "",
      "content": ""
    },
    "BAPuMa_M4_U3": {
      "airtable_id": "recAZIuRe4ipmd4jH",
      "title": "Regionalökonomie und Standortpolitik",
      "module_id": "BAPuMa_M4",
      "module_record_id": "recetQBbCUiuoQsfW",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- kennen und verstehen regional- und stadtökonomische Grundlagen,\n- kennen Entwicklungen regionaler und städtischer Standortstrukturen und können diese einordnen sowie Steuerungsmöglichkeiten aufzeigen,\n- können regional- und strukturpolitische Entscheidungen nachvollziehen und einordnen,\n- können standortpolitische Unternehmensentscheidungen nachvollziehen und verstehen.\n### Methodenkompetenz\n- Grundlagenwissen im Bereich der Regional- und Stadtökonomie zur Beurteilung von Wirtschaftsstandorten und Standortstrategien anzuwenden,\n- standortpolitisch relevante Kennzahlen zu recherchieren und zu berechnen.\n### Sozialkompetenz\n- die grundsätzliche Bedeutung institutionenübergreifender Kooperation und Kommunikation zur Bearbeitung regional- und standortpolitischer Themen zu verstehen und in eine gesteigerte eigene Kommunikations- und Kooperationsbereitschaft zu übertragen,\n- gemeinsam mit anderen Lösungen zu erarbeiten.\n### Selbstkompetenz\n- zukünftigen Kolleg\\*innen in der Verwaltung regionalökonomische Konzepte und standortpolitische Sichtweisen nahezubringen und Handlungsbedarf zu formulieren,\n- standortpolitische Maßnahmen an betriebswirtschaftlichen Kriterien zu messen und zukünftigen Kolleg\\*innen zu erläutern,\n- bei Bürger\\*innen ein Verständnis für eine nachhaltige und ressourcenorientierte Standortpolitik zu schaffen,\n- standortpolitische Entscheidungen so zu vermitteln, dass sie inhaltlich akzeptiert und nachvollzogen werden können.\n",
      "content": "- Abgrenzung von Regionen\n- Akteure\n- Transportkosten\n- Nachfrageorientierte Entwicklungstheorien\n- Regionalentwicklung und Standortinterdependenz\n- Innovation und wissensbasierte Regionalentwicklung\n- Stadtstruktur, -systeme und -entwicklung\n"
    },
    "BAPuMa_M19S_U2": {
      "airtable_id": "recBsquEWanRqnUk5",
      "title": "Menschen in schwierigen Lebenssituationen",
      "module_id": "BAPuMa_M19S",
      "module_record_id": "recEcAt6TiZA6xkK7",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- Risikofaktoren für Lebenssituationen, die zur Inanspruchnahme sozialer Hilfen führen,\n- Stigmatisierungsprozesse und Folgen von Stigmatisierungen,\n- theoretische und empirische Erkenntnisse zum Empowerment von Menschen in schwierigen Lebenssituationen und\n- Strategien zur Kommunikation in konfliktträchtigen und krisenhaften Situationen.\n### Methodenkompetenz\n- die jeweilige soziale Lage von Menschen in schwierigen Lebenssituationen reflektieren und\n- daraus Hinweise auf mögliche Interventionen ableiten.\n### Sozialkompetenz\n- an der Schnittstelle zwischen Verwaltung und sozialen Hilfen mit Mitarbeiter\\*innen anderer beteiligter Berufsgruppen kommunizieren und kooperieren,\n- die jeweilige soziale Lage ihrer Kommunikationspartner\\*innen reflektieren und ihr Kommunikationsverhalten darauf einstellen und\n- in kritischen Kommunikationssituationen angemessen reagieren.\n### Selbstkompetenz\n- Empathie und professionelle Distanz in ein angemessenes Verhältnis bringen und\n- Überforderung in der professionellen Rolle erkennen und ihr entgegenwirken.\n",
      "content": "- Risikofaktoren für Armut, Arbeitslosigkeit, soziale Probleme\n- individuelle Auswirkungen von Exklusionsprozessen\n- Aufgaben- und Rollenteilung im Bereich der sozialen Hilfen (z.B. Soziale Arbeit, psychosoziale Dienste, Hilfen zur Erziehung)\n- deeskalierende Kommunikation\n- psychosoziale Belastung und kollegiale Supervision\n"
    },
    "BAPuMa_M10_U1": {
      "airtable_id": "recCG5JRSfR9gLtkU",
      "title": "Berufspraxis",
      "module_id": "BAPuMa_M10",
      "module_record_id": "recjDHkBLAMoSLPuO",
      "semester": 3,
      "sws": "",
      "workload": "",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "",
      "content": "vgl. Gesamtmodulbeschreibung\n"
    },
    "BAPuMa_M19I_U2": {
      "airtable_id": "recCXMYYDGRQnOCFX",
      "title": "Legal Technology als Standortfaktor",
      "module_id": "BAPuMa_M19I",
      "module_record_id": "recBDLpuh4HEcvtI1",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- (potenzielle) Anwendungsgebiete von LegalTech Systemen identifizieren und daraus resultierenden Anforderungen an automatisierte Rechtsanwendungen aufnehmen und beurteilen.\n### Methodenkompetenz\n- geeignete IT-Methoden zur Umsetzung von LegalTech Anwendungen,\n- Grenzen und können Ergebnisse von LegalTech Anwendungen beurteilen.\n### Sozialkompetenz\n- Ansprechpersonen verschiedener Institutionen und Stellen mit Bezug zu LegalTech-Inhalten zu identifizieren und deren institutionellen Hintergrund zu verstehen,\n- sich im Kontext der LegalTech-Anwendungen sowohl mit Kolleg\\*innen der eigenen wie anderer Institutionen als auch mit IT-Dienstleistern zu vernetzen und mit ihnen eine zielführende Kommunikation zu führen,\n- konstruktiv an übergreifenden Projekten mitzuarbeiten,\n- gemeinsam mit anderen an Problemlösungen zu arbeiten.\n### Selbstkompetenz\n- existierende Anwendungen auf Bundes- und Länderebene sowie im privaten Sektor analysieren\n- und Chancen und Risiken beim Einsatz von Legal Tech in der Öffentlichen Verwaltung erkennen und beurteilen.\n",
      "content": "- Einführung: Begriffsklärung, Anwendungsgebiete von Legal Tech\n- Anforderungen an automatisierte Rechtsanwendungen\n- IT-Methoden zur Umsetzung von Legal Tech\n- Analyse existierender LegalTech-Anwendungen in Hamburg sowie auf nationaler und internationaler Ebene\n- Chancen und Herausforderungen von Legal Tech\n"
    },
    "BAPuMa_M16_U1": {
      "airtable_id": "recDy4Ks1MiUOM7Y5",
      "title": "Allgemeines Verwaltungsrecht III",
      "module_id": "BAPuMa_M16",
      "module_record_id": "receirLz0E0zoTzxX",
      "semester": 4,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- das Widerspruchsverfahren als erste Rechtsschutzstufe der Bürger\\*innen,\n- die wesentlichen Klagearten und vor dem Verwaltungsgericht und die weiteren Zulässigkeitsvoraussetzungen dieser Klagen.\n### Methodenkompetenz\n- mittelschwere verwaltungsrechtliche Fälle unter Heranziehung der einschlägigen Vorschriften zu lösen, indem sie sowohl die Zulässigkeit als auch die Begründetheit der oben genannten Verfahren nachvollziehbar und vertretbar prüfen.\n### Sozialkompetenz\n- Fragen der Bürger\\*innen zum Rechtsschutz beantworten,\n- Kolleg\\*innen bzw. Vorgesetzte in Rechtsschutzfragen fundiert beraten.\n### Selbstkompetenz\n- ein Widerspruchsverfahren bürgerfreundlich durchführen,\n- die Erfolgsaussichten einer verwaltungsgerichtlichen Klage beurteilen.\n",
      "content": ""
    },
    "BAPuMa_M6_U3": {
      "airtable_id": "recETlsSnzTdJBPIq",
      "title": "Allgemeines Verwaltungsrecht II (AVR II)",
      "module_id": "BAPuMa_M6",
      "module_record_id": "recNYZE75ahBg2COj",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Anforderungen an die Rechtmäßigkeit von Verwaltungsakten,\n- die Regeln zu den Nebenbestimmungen zu Verwaltungsakten.\n### Methodenkompetenz\n- Verwaltungsakte rechtmäßig zu erlassen und bekanntzugeben,\n- einfache bis mittelschwere verwaltungsrechtliche Fälle unter Heranziehung der einschlägigen Vorschriften in nachvollziehbarer und vertretbarer Weise zu lösen.\n### Sozialkompetenz\n- Fragen der Bürger\\*innen zum Allgemeinen Verwaltungsrecht beantworten,\n- Kolleg\\*innen bzw. Vorgesetzten Zweifelsfragen zum Allgemeinen Verwaltungsrecht verständlich erläutern.\n### Selbstkompetenz\n- ein Verwaltungsverfahren bürgerfreundlich durchführen,\n- die Rechtmäßigkeit von Verwaltungsakten beurteilen,\n- Ermessensentscheidungen sachgerecht treffen und begründen.\n",
      "content": "1. Materielle Rechtmäßigkeit von belastenden Verwaltungsakten\n- Subsumtion unter den Tatbestand der Ermächtigungsgrundlage\n- Prüfung der Rechtsfolge zwingender Normen\n- Prüfung der Rechtsfolge von Ermessensnormen\n1. Rechtmäßigkeitsfragen bei begünstigenden Verwaltungsakten\n2. Nebenbestimmungen zu Verwaltungsakten\n3. Anfertigung und Bekanntgabe von Verwaltungsakten\n"
    },
    "BAPuMa_M9_U3": {
      "airtable_id": "recEuG2vTqBGujRSv",
      "title": "",
      "module_id": "BAPuMa_M9",
      "module_record_id": "rec3sQTsc1Dlo1K21",
      "semester": "",
      "sws": "",
      "workload": "",
      "lehrsprache": "",
      "learning_outcomes_text": "",
      "content": ""
    },
    "BAPuMa_M17_U2": {
      "airtable_id": "recEyXSULZ2ZkjyXd",
      "title": "Veränderungs- und Innovationsmanagement",
      "module_id": "BAPuMa_M17",
      "module_record_id": "recE2Lk1bI86jcroJ",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- Phasenmodelle und einschlägige Techniken für Organisationsuntersuchungen,\n- Managementinstrumente zur Planung und Steuerung von Veränderungsprozessen,\n- Organisationsmodelle, Managementinstrumente und -methoden zur Steuerung von Innovationsprozessen.\n### Methodenkompetenz\n- einschlägige Instrumente zu oben genannten Kompetenzfeldern adäquat einsetzen und situationsadäquate Ansätze entwickeln,\n- in der Praxis an Innovations- und Veränderungsprozessen mitwirken.\n### Sozialkompetenz\n- durch Kommunikation und Kooperation ein Verständnis für Innovations- und Veränderungsprozesse schaffen und auf Akzeptanz hinwirken.\n### Selbstkompetenz\nDie Studierenden entwickeln\n- ein professionelles Verständnis der kontinuierlichen Weiterentwicklung und Innovation organisatorischer Strukturen und Prozesse im Kontext sich wandelnder Arbeits- und Umweltbedingungen,\n- die zur Bewältigung betrieblicher Veränderungsprozesse erforderliche Sensibilität.\n",
      "content": "- Organisationsuntersuchungen und ausgewählte Techniken des Organisierens\n- Managementansätze und -instrumente zur Planung und Steuerung von Veränderungsprozessen\n- Innovationsmanagement und Innovationsprozesse\n- Ausgewählte Methoden für Innovation und Veränderung\n"
    },
    "BAPuMa_M20I_U1": {
      "airtable_id": "recFXwWsaWFJ5g51n",
      "title": "Europarecht",
      "module_id": "BAPuMa_M20I",
      "module_record_id": "rec81ZwzuJf1N0VWm",
      "semester": 5,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die für die Rechtsetzung und Rechtsanwendung relevanten vertieften Kenntnisse des Staats-, Europa- und Völkerrechts,\n- insbesondere die verfassungs-, europa- und völkerrechtliche Legitimation staatlichen Handelns,\n- den Rang und die Einflussnahme der Europäischen Menschenrechtskonvention auf die nationale Rechtsordnung, insbesondere auf Landesebene der FHH,\n- das Spannungsverhältnis der verschiedenen supranationalen Rechtskreise.\n### Methodenkompetenz\n- aktuelle Fragen der Grundrechtssicherung vertiefend zu problematisieren,\n- anspruchsvolle staats- und verfassungsrechtliche Fälle unter Einbeziehung des EU-Rechts und des Konventionsrechts in nachvollziehbarer und vertretbarer Weise zu lösen.\n- Fragen der demokratischen Legitimation des Verwaltungshandeln auf die Praxis anzuwenden,\n- vertiefende Rechtsfragen der Bedeutung des Europarechts für das Verwaltungshandeln zu beantworten.\n### Sozialkompetenz\n- Bürger_innen sowie Kolleg_innen bzw. Vorgesetzten auch komplexere Aspekte des Grundgesetzes, des EU-Rechts und des Konventionsrechts bei verwaltungsrechtlichen Maßnahmen vermitteln,\n- Bürger\\*innen den Einfluss des Staats- und Verfassungsrechts sowie des EU-Rechts und des Konventionsrechts erläutern.\n### Selbstkompetenz\n- den Einfluss des Staats-, Europa- und Konventionsrechts im Rahmen des Verwaltungsverfahren sicher umsetzen,\n- die Verfassungs-, Europa- und Konventionskonformität von verwaltungsrechtlichen Maßnahmen beurteilen.\n",
      "content": "1. Allgemeine Grundrechtslehren (Vertiefung)\n- insb. Grundrechtsschutz durch Organisation und Verfahren\n- insb. staatliche Schutzpflichten in Bezug auf aktuelle Herausforderungen (Pandemien, Umweltschutz)\n- ausgesuchte Problemfelder aktueller Grundrechtsfragen anhand von Fallstudien\n"
    },
    "BAPuMa_M10_U2": {
      "airtable_id": "recGV1YYBP4TtNfXf",
      "title": "Semester",
      "module_id": "BAPuMa_M10",
      "module_record_id": "recjDHkBLAMoSLPuO",
      "semester": "",
      "sws": 1,
      "workload": "",
      "lehrsprache": "",
      "learning_outcomes_text": "[fachkompetenz] • erkennen die Relevanz wissenschaftlicher Grundlagen, Methoden und Erkenntnisse\nverschiedener Fachdisziplinen für eine spezifische berufspraktische Problemstellung,\n• erkennen i. S. einer kontinuierlichen Verbesserung situationsadäquate, fachtheoretisch\nbegründete Handlungs- und Gestaltungspotenziale für eine spezifische berufspraktische\nProblemstellung und\n• recherchieren, filtern, vertiefen bzw. eignen sich weiteres problemspezifisches Fach- und\nMethodenwissen an.\n[methodenkompetenz] 74\nDie Studierenden können eine komplexe Problemstellung unter Einbeziehung des Fach- und Methoden-\nwissens verschiedener Disziplinen ziel- und aufgabenorientiert bearbeiten und dabei\n• Instrumente des Projektmanagements zweckmäßig auswählen und anwenden,\n• erforderliches Fach- und Methodenwissen für die Projektarbeit nutzbar machen,\n• die Grundsätze wissenschaftlichen Arbeitens eigenständig umsetzen,\n• digitale Formate unter Berücksichtigung des Datenschutzes für die Projektarbeit nutzbar machen\nund\n• Lösungen für eine Problemstellung entwickeln und beurteilen und dabei rechtliche\nRahmenbedingungen, Wirtschaftlichkeit, Nachhaltigkeit, Kundenorientierung und Ethik\neinbeziehen.\n[sozialkompetenz] sich im Team über einen längeren Zeitraum und auch unter Zeitdruck motiviert\nund kooperativ mit einer Problemstellung auseinandersetzen und dabei\n• eigene Stärken identifizieren und diese in die Projektarbeit einbringen,\n• Rollenanforderungen klären und erfüllen,\n• Aufgaben verantwortungsvoll und fristgerecht erledigen,\n• eigene Ideen einbringen und Ideen anderer einbeziehen,\n• im Team situationsadäquat und aufgaben- bzw. zielorientiert zusammenarbeiten, entscheiden\nund handeln,\nihre Kritikfähigkeit ausbauen,\nihr Verhalten im Team reflektieren und weiterentwickeln,\n• \n• \n• Konflikten vorbeugen bzw. Konflikte konstruktiv lösen,\n• \n• \n• die Projektarbeit und (Zwischen-)Ergebnisse adressatengerecht aufbereiten und präsentieren.\nihre Beratungskompetenz und Kunden-/Adressatenorientierung weiterentwickeln,\nverantwortungsvoll und adressatengerecht in Wort und Schrift kommunizieren,\n[selbstkompetenz] Die  Studierenden  eignen  sich  eine  wissenschaftliche  und  forschende  Haltung  an  und  erkennen  deren\nRelevanz für das Verwaltungshandeln im Allgemeinen sowie für ihr eigenes berufliches Handeln. Sie\nschulen ihr kritisches Denken,\n• \n• argumentieren wissenschaftlich und legen fachliche Positionen, methodische Erfordernisse und\nerarbeitete Problemlösungen nachvollziehbar und überzeugend dar,\n• \n• reflektieren ihre Methoden-/Instrumentenauswahl und -anwendung und erkennen Gestaltungs-\nund Handlungsoptionen,\nreflektieren ihr eigenes Handeln im Projektteam sowie hinsichtlich des Projektverlaufs und -\nergebnisses und leiten Entwicklungspotenzial ab.\n• entwickeln als berufliches Selbstbild eine „Haltung des Ermöglichens“ und der „Innovation“.\n75\n",
      "content": "vgl. Gesamtmodulbeschreibung\n"
    },
    "BAPuMa_M3_U2": {
      "airtable_id": "recH9Mq2KGJGvRgAn",
      "title": "Kosten- und Leistungsrechnung (KLR)",
      "module_id": "BAPuMa_M3",
      "module_record_id": "recKXUbbqwFhedFli",
      "semester": 2,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nund verstehen\n- Ziele und Aufgaben der Kosten- und Leistungsrechnung im Rahmen des öffentlichen Rechnungswesens,\n- die Voll- und Teilkostenrechnung und deren Bedeutung für betriebliche Entscheidungsprobleme,\n- Aufbau, Methoden und Funktionsweise der Voll- und Teilkostenrechnung,\n- Verfahren der Plankostenrechnung und deren Bedeutung für die Budgetierung.\n### Methodenkompetenz\nin der Berufspraxis\n- KLR-Instrumente und Methoden situationsadäquat einsetzen und nutzen,\n- an der Entwicklung situationsadäquater Konzepte der Kosten- und Leistungsrechnung mitwirken,\n- begründete Maßnahmen zur Effizienzsteuerung entwickeln.\n### Sozialkompetenz\nin ihrer Berufspraxis\n- durch adäquate Kommunikation und Kooperation ein Verständnis und Bewusstsein für Kosten und Effizienz fördern,\n- situationsadäquate KLR-Ansätze so vermitteln, dass sie akzeptiert werden.\n### Selbstkompetenz\n- bestehende KLR-Konzepte reflektieren,\n- ein  Verständnis  der  Weiterentwicklung  und  Innovation  von  KLR-Konzepten  im  Kontext  sich wandelnder (Rahmen-)bedingungen entwickeln.\n",
      "content": "## Grundlagen der Kosten- und Leistungsrechnung\n- Ziele, Aufbau und Grundsätze der Kosten- und Leistungsrechnung\n- Abgrenzungsrechnung\n- Kostenkategorien und Verrechnungsprinzipien\n- Kostenfunktionen, Kostenverläufe, Break-Even-Analyse\n"
    },
    "BAPuMa_M14_U2": {
      "airtable_id": "recI1xdkTOxzKrb4F",
      "title": "Ordnungswidrigkeitenrecht (OWiR)",
      "module_id": "BAPuMa_M14",
      "module_record_id": "rechEoBiLibBbh92m",
      "semester": 4,
      "sws": 2,
      "workload": "Präsenzstudium 102 h, Selbststudium 78 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die historische Entwicklung des Ordnungswidrigkeitenrechts,\n- die verfassungsrechtlichen Vorgaben des Ordnungswidrigkeitenrechts,\n- die wesentlichen Normen des Ordnungswidrigkeitengesetzes.\n### Methodenkompetenz\n- einfache bis mittelschwere Fälle aus dem Ordnungswidrigkeitenrecht unter Heranziehung der einschlägigen Vorschriften in nachvollziehbarer und vertretbarer Weise zu lösen,\n- die Sanktionen des Ordnungswidrigkeitenrechts zu benennen und anzuwenden,\n- ein Bußgeldverfahren durchzuführen.\n### Sozialkompetenz\n- Fragen der Bürger\\*innen zum Ordnungswidrigkeitenrecht beantworten,\n- Kolleg\\*innen bzw. Vorgesetzten Zweifelsfragen zum Ordnungswidrigkeitenrecht verständlich erläutern.\n### Selbstkompetenz\n- die Verwirklichung einer Ordnungswidrigkeit prüfen,\n- ein Bußgeldverfahren in seinen Grundzügen erläutern und grundlegende Entscheidungen hierzu fällen,\n- die Rechtsschutzmöglichkeiten gegen ein Bußgeld erläutern.\n",
      "content": "1. Einführung in das Rechtsgebiet\n- Geschichte und Entwicklung\n- Geltungsbereich des Ordnungswidrigkeitengesetzes\n- Verhältnis zum Strafrecht\n- Bezüge zum Verfassungsrecht\n- Aufbau des Ordnungswidrigkeitengesetzes\n1. Die Prüfung des Vorliegens einer Ordnungswidrigkeit\n- Tatbestand\n- Rechtswidrigkeit/Rechtfertigungsgründe\n- Vorwerfbarkeit\n1. Weitere Grundfragen aus dem allgemeinen Ordnungswidrigkeitenrecht\n- Unterlassungstat\n- Beteiligung\n- Versuch\n1. Sanktionen ordnungswidrigen Verhaltens\n2. Das Verfahren im Ordnungswidrigkeitenrecht im Überblick\n"
    },
    "BAPuMa_M20D_U2": {
      "airtable_id": "recI5QqVw5fj0XUCg",
      "title": "Chancen und Risiken der Digitalisierung",
      "module_id": "BAPuMa_M20D",
      "module_record_id": "recnpLQNRghK91kWq",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die ambivalenten Auswirkungen digitalisierter Arbeit auf individueller Ebene (z.B. Entgrenzung vs. Vereinbarkeit, Arbeitserleichterung vs. Belastung, Transparenz vs. Überwachung, Partizipation vs. Polarisierung),\n- die spezifischen Anforderungen an Teamarbeit und Führung in virtuellen Teams und\n- die ambivalenten Auswirkungen von Digitalisierung auf gesellschaftlicher Ebene (insbesondere auf Arbeitsmärkte, politische Meinungsbildung).\n### Methodenkompetenz\n- die ambivalenten Auswirkungen digitalisierter Arbeit bei ihren beruflichen Entscheidungen berücksichtigen und\n- daraus angemessene Handlungsstrategien ableiten.\n### Sozialkompetenz\n- Chancen und Risiken digitaler Kommunikation und Kollaboration einschätzen und\n- digitale Kommunikation und Kollaboration zielgruppen- und situationsadäquat nutzen.\n### Selbstkompetenz\n- Potenziale von Digitalisierung für soziale Integration und soziale Teilhabe in ihren Arbeitsbereichen identifizieren und\n- unter Berücksichtigung ethischer Grundsätze zur digitalen Weiterentwicklung ihrer Arbeitsbereiche beitragen.\n",
      "content": "- spezifische Belastungen durch digitalisiertes Arbeiten\n- Anforderungen digitaler Kommunikation (Teamarbeit, Führung, Barrierefreiheit)\n- Auswirkungen der Digitalisierung auf die politische Meinungsbildung\n- Entwicklungen auf dem Arbeitsmarkt: Substituierbarkeitspotenziale\n"
    },
    "BAPuMa_M13_U1": {
      "airtable_id": "recIUlDKIvxiFBNCY",
      "title": "Personalwirtschaft (PW)",
      "module_id": "BAPuMa_M13",
      "module_record_id": "recxZKUcUxaQlQkjR",
      "semester": 4,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- kennen Bedeutung und Aufgaben des Personalmanagements,\n- kennen und verstehen Methoden und Instrumente der Personalbedarfsplanung und deren Bezüge zur Stellenwirtschaft,\n- verfügen über ein solides Wissen über die personalwirtschaftlichen Handlungsfelder Personalbeschaffung/-gewinnung,  Personalfreisetzung  und  Personaleinsatz  sowie  betriebliche  Anreizsysteme,\n- verfügen  über  ein  solides  Wissen  über  Ansätze  zur  (flexiblen)  Gestaltung  von  Arbeitsplatz, Arbeitsort  und  Arbeitszeit  und  können  Implikationen  für  Arbeitsorganisation  und  -koordination herstellen.\n### Methodenkompetenz\n- Instrumente zu obengenannten Kompetenzfeldern situationsadäquat einsetzen und nutzen,\n- in ihrer Berufspraxis an der Entwicklung situationsadäquater personalwirtschaftlicher Konzepte mitwirken.\n### Sozialkompetenz\n- durch adäquate Kommunikation und Kooperation personalwirtschaftliche und organisatorische Konzepte in der Berufspraxis vermitteln und die Akzeptanz mit fördern.\n### Selbstkompetenz\nDie Studierenden entwickeln\n- ein  professionelles  Verständnis  der  kontinuierlichen  Weiterentwicklung  und  Innovation  von personalwirtschaftlichen Konzepten im Kontext sich wandelnder Rahmenbedingungen.\n",
      "content": "- Grundlagen des Personalmanagements\n- Grundlagen der Personalbedarfsplanung\n- Personalbeschaffung/-gewinnung\n- Personalfreisetzung\n- Personaleinsatz, Gestaltung von Arbeitszeit und Arbeitsort\n- Betriebliche Anreizsysteme\n"
    },
    "BAPuMa_M3_U1": {
      "airtable_id": "recKGBvXL91DmbhIS",
      "title": "Öffentliche Finanzwirtschaft I und II (ÖFW I + II)",
      "module_id": "BAPuMa_M3",
      "module_record_id": "recKXUbbqwFhedFli",
      "semester": 1,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n## Die Studierenden können\n- das Grundsystem der Doppik begreifen, Finanz-, Ergebnisrechnung und Bilanz als Instrumente der Liquiditäts-, Erfolgs- und Vermögensermittlung verstehen,\n- die Bestandteile und die Grundlagen des Rechnungswesens auf doppischer Basis in öffentlichen Unternehmen erkennen und ihr Zusammenwirken verstehen.\n### Methodenkompetenz\n## Die Studierenden können\n- Geschäftsvorfälle aus verschiedenen Bereichen der öffentlichen Verwaltung buchhalterisch verarbeiten,\n- entsprechende Geschäftsvorfälle sachgerecht analysieren und buchungsmäßig behandeln.\n### Sozialkompetenz\n## Die Studierenden können\n- haushalts- und finanzwirtschaftliche Vorschriften anwenden und bei den Bürger\\*innen ein Verständnis für ein nachhaltiges und ressourcenorientiertes öffentliches Haushaltswesen schaffen,\n- wirtschaftliche Verhaltensweisen und haushaltsrechtliche Ansätze ihren künftigen Kolleg\\*innen so vermitteln, dass sie inhaltlich akzeptiert und nachvollzogen werden.\n### Selbstkompetenz\n## Die Studierenden können\n- geplante Änderungen der Bilanzierung in Richtung auf ein wirkungsorientiertes Rechnungswesen und damit zusammenhängende Probleme in das bestehende System integrieren,\n- geplante  Änderungen  zu  einem  internationalen  öffentlichen  Rechnungswesen  und  damit zusammenhängende Probleme nationaler Rechnungslegung reflektieren.\n",
      "content": "## Grundbegriffe des öffentlichen Rechnungswesens\n- Auszahlung/Einzahlung, Ausgabe/Einnahme, Aufwand/Ertrag, Strömungsgrößen und Bestandsgrößen\n- Bestandskonten, Erfolgskonten, Finanzkonten, Buchungssätze, Ergebnisrechnung, Bilanz, Inventar\n- Käufe, Verkäufe, Kreditaufnahme, Forderungen, Verbindlichkeiten\n"
    },
    "BAEGov_M1_U2": {
      "airtable_id": "recLPCYv9vEfwxZqa",
      "title": "",
      "module_id": "BAEGov_M1",
      "module_record_id": "recPy8KdlgMFTKv5K",
      "semester": "",
      "sws": "",
      "workload": "",
      "lehrsprache": "",
      "learning_outcomes_text": "",
      "content": ""
    },
    "BAPuMa_M18_U1": {
      "airtable_id": "recMtUFY9SBMKPazg",
      "title": "",
      "module_id": "BAPuMa_M18",
      "module_record_id": "recun8SD5VwOd2ncV",
      "semester": "",
      "sws": "",
      "workload": "",
      "lehrsprache": "",
      "learning_outcomes_text": "",
      "content": ""
    },
    "BAPuMa_M4_U1": {
      "airtable_id": "recN32jBpPFNJhMMa",
      "title": "Grundlagen der Volkswirtschaftslehre und Wirtschaftspolitik I",
      "module_id": "BAPuMa_M4",
      "module_record_id": "recetQBbCUiuoQsfW",
      "semester": 1,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- grundlegende volkswirtschaftliche Zusammenhänge und wirtschaftspolitische Ansätze, insbesondere im Bereich der mikroökonomischen Theorie und Funktionsweise von Märkten, zu verstehen,\n- das Verhalten einzelwirtschaftlicher Akteure vor dem Hintergrund volkswirtschaftlicher Strukturen und die Rolle des Staates im Wirtschaftssystem zu verstehen,\n- Gründe für staatliche Markteingriffe zu identifizieren und die Auswirkungen wirtschaftspolitischer Maßnahmen zu verstehen.\n### Methodenkompetenz\n- angemessen mit modelltheoretischen Aussagen und statistischen Kennzahlen umzugehen,\n- reale volkswirtschaftliche Sachverhalte mit abstrakten modelltheoretischen Ansätzen zu analysieren.\n### Sozialkompetenz\n- eigene Standpunkte zu formulieren und zu begründen,\n- die Komplexität volkswirtschaftlicher und wirtschaftspolitischer Zusammenhänge und damit andere Standpunkte anzuerkennen,\n- gemeinsam mit anderen Lösungen zu erarbeiten.\n### Selbstkompetenz\n- die Aufgaben des Staates in einem gesamtwirtschaftlichen Zusammenhang zu reflektieren und diese Gesamtsicht nach außen bürgernah zu vertreten und darzustellen,\n- die Intentionen und Gründe staatlicher Aufgabenwahrnehmung besser zu verstehen und sind somit besser in der Lage sich mit diesen zu identifizieren.\n",
      "content": "- Hauptaufgaben, Grundfragen und Grundbegriffe der Volkswirtschaftslehre\n- Wirtschaftssubjekte und Produktionsfaktoren\n- Theorie von Marktnachfrage, Marktangebot und Marktgleichgewicht als Ergebnis des Preisbildungsprozesses\n- Bedeutung und Funktionen von Preisen\n- Gründe und Auswirkungen staatlicher Markteingriffe\n- Ökonomik des öffentlichen Sektors\n- Unterschiedliche Marktformen und Wettbewerbsschutz\n"
    },
    "BAPuMa_M12_U2": {
      "airtable_id": "recNIBJHdtHTl4pkj",
      "title": "Planung und Steuerung von öffentlichen Investitionen",
      "module_id": "BAPuMa_M12",
      "module_record_id": "recOSHMVAP0cLNY70",
      "semester": 4,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Bedeutung der effektiven Investitionssteuerung für die öffentliche Hand,\n- Rationalitätskonzepte und Ansätze zur Rationalitätssicherung,\n- Beziehungen zwischen Zielen und Verfahren der Investitionsrechnung,\n- theoretische Grundlagen und implizite Prämissen von Methoden und deren Auswirkungen auf den Transfer auf den öffentlichen Sektor\n### Methodenkompetenz\nDie Studierenden\n- können insbesondere Verfahren der dynamischen Investitionsrechnung kontextabhängig anwenden und Ergebnisse interpretieren,\n- können Schwachstellen in Investitionsprozessen identifizieren,\n- sind in der Lage, erforderliche Daten für die anzuwendenden Verfahren zu bestimmen\n### Sozialkompetenz\n- Informationsbedarfe und Methoden der Planung und Entscheidung den Kolleg\\*innen darzustellen und dabei adressatengerecht ihre Aussagefähigkeit zu begründen,\n### Selbstkompetenz\n- Wirtschaftlichkeitsuntersuchungen professionell durchzuführen und Ergebnisse von Wirtschaftlichkeitsuntersuchungen kritisch zu hinterfragen\n",
      "content": "- Unterschiedliche Systemlogiken und Zweckmäßigkeitslogik\n- Verfahren der Investitionsrechnung, insbesondere dynamische Verfahren\n- Anforderungen an den Transfer von Verfahren auf Spezifika des öffentlichen Sektors (Differenzbetrachtungen) vor dem Hintergrund theoretischer Grundlagen und impliziter Annahmen\n- Auswirkungen des Transfers auf Infrastrukturentscheidungen, Rationalisierungsinvestitionen und Instandhaltungsfragen\n- Analyse von Schwachstellen (Beschreibungsmodelle, Bewertungsmodelle, kognitive Verzerrungen) und Ansätze der Rationalitätssicherung\n- Risiken, mehrdimensionale Bewertungen\n"
    },
    "BAPuMa_M15_U2": {
      "airtable_id": "recNS247BwjMiflbH",
      "title": "IT-Aspekte der Digitalisierung I (ITD1)",
      "module_id": "BAPuMa_M15",
      "module_record_id": "rece0marBBbivRmT5",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- kennen Szenarien mit großen Datenbeständen (BigData) und Techniken ihrer Nutzung,\n- haben einen Überblick über Anwendungsgebiete der IT-Sicherheit,\n- kennen Methoden zur Aufnahme von Geschäftsprozessen und ihrer Implementierung.\n### Methodenkompetenz\nDie Studierenden\n- können Anforderungen an Anwendungen mit großen Datenbeständen formulieren,\n- kennen Methoden der Verschlüsselung und digitaler Signaturen.\n### Sozialkompetenz\n- mit Kolleg\\*innen und externen Institutionen im Sinne einer gemeinsamen Nutzung verfügbarer Datenbestände, der Implementierung von Sicherheitsmaßnahmen und (übergreifend optimierter) Geschäftsprozesse zu kooperieren.\n### Selbstkompetenz\nDie Studierenden\n- erkennen das Potenzial für die IT-Abbildung von Geschäftsprozessen,\n- besitzen das Fachvokabular, um auch mit IT-Kolleg_innen und externen Partner_innen bei der Digitalisierung von Geschäftsprozessen konstruktiv zusammenzuarbeiten,\n- können Potenzial für die Optimierung von Geschäftsprozessen erkennen und kennen Möglichkeiten der IT-Umsetzung,\n- erkennen Schwachstellen im Kontext der IT-Sicherheit\n",
      "content": "- Big Data und KI als Instrument der Datenanalyse\n- Zielsetzung und Anwendungsbereiche\n- Überblick über Einsatzmöglichkeiten von Big Data und KI in der Öffentlichen Verwaltung\n- Einführung in die IT-Sicherheit\n- Überblick über Angriffsvarianten im Internet\n- Methoden der Datenverschlüsselung\n- Varianten digitaler Signatur\n- Aktuelle Entwicklungen\n- IT-Abbildung von Geschäftsprozessen\n- Voraussetzungen zur Digitalisierung von Geschäftsprozessen\n- Software zur Umsetzung\n- Analyse aktueller Umsetzungsbeispiele\n"
    },
    "BAPuMa_M7_U2": {
      "airtable_id": "recNSdL5wLfhb2tHl",
      "title": "Personalrecht I",
      "module_id": "BAPuMa_M7",
      "module_record_id": "rec5UDQzlWK6DZnpE",
      "semester": 1,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Rechtsverhältnisse der im öffentlichen Dienst Beschäftigten zu überblicken,\n- fallbezogen im rechtlich-strukturierten Rahmen im Beamtenrecht als auch - in Grundzügen - im Tarifrecht (Tarifbeschäftigte) personalrelevante Entscheidungen insbesondere auch unter Anwendung der Grundlagen der Rechtsmethodik (siehe Modul 2 Unit 1) zu treffen.\n### Methodenkompetenz\n## Die Studierenden\n- überblicken die wesentlichen Strukturen des Beamtenrechts und des Rechts der Tarifbeschäftigten und können diese erläutern,\n- können die für den Einzelfall maßgeblich Vorschriften des Beamtenrechts und des Rechts der Tarifbeschäftigen ermitteln, sie ggfs. auslegen und auf den Einzelfall anwenden,\n- sind in der Lage, die getroffenen Entscheidungen überzeugend zu begründen.\n### Sozialkompetenz\n## Die Studierenden\n- sind  in  der  Lage,  das  eigene  Dienstrechtsumfeld  (Beamtenrecht  im  Rahmen  der  Normenpyramide) zu erkennen,\n- können  die  gegenläufigen  Interessen  in  einem  Arbeitsteam  auch  in  ihren  außerrechtlichen Implikationen erkennen,\n- können Konfliktsituationen in rechtliche Formen (prozeduraler und inhaltlicher Art) fassen und\n- entsprechende  Konfliktlagen  letztlich  rechtlich  zutreffend,  transparent  und  für  die  Betroffenen nachvollziehbar entscheiden.\n### Selbstkompetenz\nDie Studierenden\n- können die Methoden und Techniken der Rechtsanwendung auf den Gebieten des Beamtenrechts und des Rechts der Tarifbeschäftigten in ihrer Relevanz erkennen und anwenden,\n- sind in der Lage, vorfindliche Rechtsansichten kritisch und methodengerecht zu analysieren, ggfs. zu bestätigen oder begründet und nachvollziehbar zu widerlegen.\n",
      "content": "- Geschichte des Beamtenrechts\n- Rechtsquellen des Beamtenrechts, insbesondere Funktion und Inhalt des Art. 33 GG\n- Grundbegriffe des Beamtenrechts\n- Das Beamtenverhältnis: Arten der Beamtenverhältnisse, Begründung und Veränderung durch Ernennung, fehlerhafte Ernennungen (Nichtigkeit und Rücknahme), sonstige amtsrechtliche Veränderungen, Beendigung des Beamtenverhältnisses\n- Laufbahnrecht der Beamtinnen und Beamten: Laufbahnverordnung, Laufbahnprinzip, Laufbahngruppen\n"
    },
    "BAPuMa_M20S_U1": {
      "airtable_id": "recPar8aS5XCK4rQ1",
      "title": "Wohlfahrtsökonomie",
      "module_id": "BAPuMa_M20S",
      "module_record_id": "rec3p8EUNSA8AsoFL",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n## Die Studierenden\n- verstehen grundlegende wohlfahrtsökonomische Konzepte und können sie in Zusammenhang mit wirtschaftspolitischen Entscheidungen und deren Umsetzung bringen,\n- verstehen Zielkonflikte zwischen volkswirtschaftlicher Effizienz und Verteilung vor dem Hintergrund unterschiedlicher Gerechtigkeitsprinzipien im Rahmen normativer Volkswirtschaftslehre,\n- können staatliches Handeln im Kontext eines marktwirtschaftlich organisierten Sozialstaates aus einer wohlfahrtsökonomischen Perspektive einordnen sowie entsprechende Auswirkungen einschätzen und\n- kennen für die Funktionsweise eines Sozialstaates relevante Megatrends und können deren mögliche Auswirkungen einschätzen.\n### Methodenkompetenz\n- wirtschaftspolitische Maßnahmen und staatliches Handeln aus einer wohlfahrtsökonomischen Perspektive bewerten,\n- reale volkswirtschaftliche Sachverhalte mit abstrakten modelltheoretischen Ansätzen analysieren und\n- (Verteilungs-)Gerechtigkeitsvorstellungen reflektieren.\n### Sozialkompetenz\n- unterschiedliche Standpunkte im Rahmen wirtschafts- und verteilungspolitischer Zusammenhänge vertreten und anerkennen und\n- gemeinsam mit anderen Lösungen erarbeiten.\n### Selbstkompetenz\n## Die Studierenden können\n- staatliche Maßnahmen und damit auch eigene Funktionen und Aufgaben im Verwaltungskontext in einem gesamtwirtschaftlichen Zusammenhang reflektieren und diese Gesamtsicht nach außen bürgernah vertreten und darstellen.\n",
      "content": "- Sozialstaat und soziale Marktwirtschaft\n- effizientes Marktergebnis und volkswirtschaftliche Wohlfahrt\n- Pareto-Effizienz\n- Wohlfahrtstheoreme und Zielkonflikte zwischen Effizienz und Verteilung\n- Marktversagen und Wohlfahrtseffekte\n- staatliche Eingriffe zur Wohlfahrtssteigerung\n- Besteuerung und Umverteilung\n- Gerechtigkeitsprinzipien\n- Einkommensverteilung\n- Produktivität und Wachstum\n- Megatrends und der Sozialstaat\n"
    },
    "BAPuMa_M20H_U1": {
      "airtable_id": "recPsuwdR3kOoyHah",
      "title": "Spezielle Fragen des Haushaltsrechts",
      "module_id": "BAPuMa_M20H",
      "module_record_id": "reccwfWvbK2STQFCQ",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- haben ein fundiertes Verständnis von öffentlichen Haushalten und deren Finanzierungsproblemen\n- verstehen die Anforderungen an treffsichere Prognoseverfahren für öffentliche Einnahmen.\n### Methodenkompetenz\n- ausgewählte Trendverfahren in der Praxis interpretieren und erforderliche Informationsbedarfe identifizieren\n- Zielkonflikte zwischen Einhaltung der Schuldenbremse und fiskalpolitischer Gestaltung von öffentlichen Investitionen.\n### Sozialkompetenz\n- Bürger\\*innen die Bedeutung der Schuldenbremse für nachhaltiges Verwaltungshandeln einerseits und die Durchführung notwendiger staatlicher Infrastrukturmaßnahmen andererseits adäquat vermitteln.\n### Selbstkompetenz\nDie Studierenden\n- kennen die Bedeutung einer Analyse der Ausgangssituation für situationsadäquate Steuerungsansätze für eine wirtschaftliche Verwaltungssteuerung\n- reflektieren politische Äußerungen zur Verschuldung des öffentlichen Sektors vor dem Hintergrund seiner nachhaltigen Funktionsfähigkeit.\n",
      "content": "- Schuldenbremse\n- Abgrenzung von Verwaltungsschulden zu Privatkrediten\n- Mögliche Steuerschätzverfahren und deren Anwendung\n"
    },
    "BAPuMa_M20P_U3": {
      "airtable_id": "recRC9xh885qhomVk",
      "title": "Personal- und Organisationsentwicklung - Vertiefung",
      "module_id": "BAPuMa_M20P",
      "module_record_id": "reciiD6VPiR3lg0s4",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- erkennen zentrale Zusammenhänge zwischen Personalentwicklung und Organisationsentwicklung,\n- verstehen die zentrale Bedeutung von Transfersicherung und Evaluation für die Personalentwicklung und\n- kennen aktuelle Entwicklungen und Konzepte der Organisationsentwicklung.\n### Methodenkompetenz\nDie Studierenden\n- können Organisationsentwicklungsprozesse und die mit ihnen verbundenen Personalentwicklungsmaßnahmen grundlegend planen.\n### Sozialkompetenz\n## Die Studierenden\n- können in ihrem Verantwortungsbereich Verständnis für die Voraussetzungen und die Reichweite von Organisationsentwicklungsprozessen wecken und solche Prozesse kommunikativ begleiten.\n### Selbstkompetenz\nDie Studierenden\n- reflektieren  ihre  eigene  Verantwortung  für  die  Schaffung  und  den  Erhalt  einer  veränderungsförderlichen Organisationskultur.\n",
      "content": "- Instrumente der Personalentwicklung (Vertiefung)\n- Transfersicherung von Personalentwicklungsmaßnahmen\n- Evaluation von Personalentwicklungsmaßnahmen\n- soziotechnische Systemtheorie, Organisationskultur und organisationale Muster als Basis von Organisationsentwicklungsprozessen\n- Methoden dialogischer Organisationsentwicklung, z.B. organisationales Geschichtenerzählen, Survey Feedback, wertschätzende Befragung\n"
    },
    "BAPuMa_M16_U4": {
      "airtable_id": "recRPzOAlATm7PhJ9",
      "title": "Besonderes Verwaltungsrecht II Wirtschaftsverwaltungsrecht",
      "module_id": "BAPuMa_M16",
      "module_record_id": "receirLz0E0zoTzxX",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Grundstrukturen und Instrumentarien des Gewerberechts,\n- typische Problemstellungen des Gewerberechts.\n- die subsidiäre Bedeutung des Polizei- und Ordnungsrecht in den unterschiedlichen Bereichen des Gewerberechts,\n- typische Rechtsschutzfragen des Gewerberechts.\n### Methodenkompetenz\n- in gewerberechtlichen Einzelfällen die Problemlagen zu erkennen und mit den bereitstehenden gewerberechtlichen Instrumenten sachgerecht zu reagieren,\n- mittelschwere Fälle unter Heranziehung der einschlägigen Vorschriften plausibel zu lösen.\n### Sozialkompetenz\n- Bürger\\*innen die Rechtslage erläutern und Hinweise auf notwendige Anträge usw. geben,\n- die Rechtsgrundlagen des Gewerberechts rechtssicher anwenden.\n### Selbstkompetenz\n- rechtmäßige Verwaltungsakte im Gewerberecht auch in unklaren Fällen erlassen,\n- die verfassungsrechtlichen Zusammenhänge erkennen.\n",
      "content": ""
    },
    "BAPuMa_M19P_U1": {
      "airtable_id": "recSOytGKpGxfvVnz",
      "title": "Ausgewählte Problemstellungen des Personal- und Organisationsmanagements (PersO)",
      "module_id": "BAPuMa_M19P",
      "module_record_id": "rec0RrTuoPPydOzfz",
      "semester": 5,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- verstehen Personalmanagement als strategisches Handlungsfeld,\n- haben ein fundiertes Wissen über Bedeutung, Ansätze und Herausforderungen der Personalbedarfsplanung, des Personal(kosten)controllings sowie des Personalmarketings und der Personalbindung,\n- können personalwirtschaftliche Gestaltungsansätze des Personaleinsatzes (bspw. Arbeitsortund Arbeitszeitmodell) verstehen, einordnen und reflektieren,\n- haben ein fundiertes Wissen über Bedeutung, Ansätze und Herausforderungen des Wissensmanagements,\n- kennen einschlägige Qualitätsmanagementmodelle und -systeme und können deren Relevanz für die öffentliche Verwaltung einordnen.\n### Methodenkompetenz\n- Instrumente zu obengenannten Kompetenzfeldern situationsadäquat einsetzen und nutzen,\n- in  ihrer  Berufspraxis  an  der  Entwicklung  situationsadäquater  Konzepte  zu  obengenannten Kompetenzfeldern mitwirken.\n### Sozialkompetenz\nDie Studierenden\n- können durch adäquate Kommunikation und Kooperation personalwirtschaftliche und organisatorische Konzepte in der Berufspraxis vermitteln und die Akzeptanz mit fördern.\n### Selbstkompetenz\nDie Studierenden\n- entwickeln ein professionelles Verständnis der kontinuierlichen Weiterentwicklung und Innovation von personalwirtschaftlichen und organisatorischen Handlungsansätzen im Kontext sich wandelnder Rahmenbedingungen,\n- können  moderne  (Zeitgeist-)Ansätze  einordnen,  auf  Basis  ihrer  fundierten  wissenschaftlichen Kenntnisse bewerten und adäquat nutzen.\n",
      "content": "- Strategische Ausrichtung des Personalmanagements\n- Ausgewählte Ansätze der Personalbestands- und -bedarfsplanung\n- Personalkostenmanagement und -controlling\n- Personalmarketing und -bindung\n- Personalwirtschaftliche Gestaltungsansätze des Personaleinsatzes (bspw. Arbeitszeit und Arbeitsort)\n- Wissensmanagement: Grundlagen, Instrumente, Barrieren und Erfolgskriterien\n- Ausgewählte Qualitätsmanagementsysteme für die öffentliche Verwaltung\n"
    },
    "BAPuMa_M7_U4": {
      "airtable_id": "recUfD8cx4h3tmqTb",
      "title": "Personalrecht II",
      "module_id": "BAPuMa_M7",
      "module_record_id": "rec5UDQzlWK6DZnpE",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- sind in der Lage, die Rechtsverhältnisse der im öffentlichen Dienst Beschäftigten zu überblicken,\n- können fallbezogen im rechtlich-strukturierten Rahmen im Beamtenrecht als auch - in Grundzügen - im Tarifrecht (Tarifbeschäftigte) personalrelevante Entscheidungen insbesondere auch unter Anwendung der Grundlagen der Rechtsmethodik (siehe Modul 2 Unit 1) treffen.\n### Methodenkompetenz\n## Die Studierenden\n- überblicken die wesentlichen Strukturen des Beamtenrechts und des Rechts der Tarifbeschäftigten und können diese erläutern,\n- können die für den Einzelfall maßgeblich Vorschriften des Beamtenrechts und des Rechts der Tarifbeschäftigen ermitteln, sie ggfs. auslegen und auf den Einzelfall anwenden,\n- sind in der Lage, die getroffenen Entscheidungen überzeugend zu begründen.\n### Sozialkompetenz\n## Die Studierenden\n- sind  in  der  Lage,  das  eigene  Dienstrechtsumfeld  (Beamtenrecht  im  Rahmen  der  Normenpyramide) zu erkennen,\n- können  die  gegenläufigen  Interessen  in  einem  Arbeitsteam  auch  in  ihren  außerrechtlichen Implikationen erkennen,\n- können Konfliktsituationen in rechtliche Formen (prozeduraler und inhaltlicher Art) fassen und\n- entsprechende  Konfliktlagen  letztlich  rechtlich  zutreffend,  transparent  und  für  die  Betroffenen nachvollziehbar entscheiden.\n### Selbstkompetenz\n## Die Studierenden\n- sind in der Lage, die Methoden und Techniken der Rechtsanwendung auf den Gebieten des Beamtenrechts und des Rechts der Tarifbeschäftigten in ihrer Relevanz zu erkennen und anzuwenden,\n- können vorfindliche Rechtsansichten kritisch und methodengerecht analysieren, ggfs. bestätigen oder begründet und nachvollziehbar widerlegen.\n",
      "content": "- Pflichten der Beamtinnen und Beamten\n- Pflichtverletzungen der Beamtinnen und Beamten und ihre Folgen (Disziplinarrecht): Zweck des Disziplinarrechts; formelles und materielles Disziplinarrecht; Begriff des Dienstvergehens; Verhältnis Straf- und Disziplinarrecht; Voraussetzungen einer disziplinaren Ahndung; Disziplinarverfahren\n- Haftung im Öffentlichen Dienst (Beamte und Tarifbeschäftigte): Prinzip und Inhalt der Staatshaftung, insbesondere Amtshaftung; Regressmöglichkeiten bei Fremdschäden; Schadensersatz bei Eigenschäden\n- Rechte der Beamtinnen und Beamten\n- Grundzüge der Beamtenbesoldung und der Beamtenversorgung\n- Auswahl sonstiger Rechtsfragen des Beamtenrechts, beispielsweise Personalaktenrecht, dienstliche Beurteilung, Gleichstellung und Gleichberechtigung, Personalvertretungsrecht\n"
    },
    "BAPuMa_M6_U1": {
      "airtable_id": "recVhmm0PQ2kK0b2q",
      "title": "Allgemeines Verwaltungsrecht I (AVR I)",
      "module_id": "BAPuMa_M6",
      "module_record_id": "recNYZE75ahBg2COj",
      "semester": 1,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n,\n- die verfassungsrechtlichen Vorgaben für die Verwaltung,\n- die wesentlichen Normen des Verwaltungsverfahrensgesetzes,\n- die Handlungsformen der Verwaltung und ihre jeweiligen rechtlichen Anforderungen.\n### Methodenkompetenz\n- einfache bis mittelschwere verwaltungsrechtliche Fälle unter Heranziehung der einschlägigen Vorschriften in nachvollziehbarer und vertretbarer Weise zu lösen.\n### Sozialkompetenz\n,\n- Fragen der Bürger\\*innen zum Allgemeinen Verwaltungsrecht beantworten,\n- Kolleg\\*innen bzw. Vorgesetzten Zweifelsfragen zum Allgemeinen Verwaltungsrecht verständlich erläutern.\n### Selbstkompetenz\n- ein Verwaltungsverfahren bürgerfreundlich durchführen,\n- die Rechtmäßigkeit von Verwaltungsakten beurteilen,\n- Ermessensentscheidungen sachgerecht treffen und begründen.\n",
      "content": "1.  Grundbegriffe des Allgemeinen Verwaltungsrechts\n- Begriff der Verwaltung\n- Verfassungsrechtliche Vorgaben für das Verwaltungsrecht\n- Träger der Verwaltung\n1. Die Arten des Verwaltungshandelns\n- Der Verwaltungsakt als wichtigste Handlungsform\n- Weitere Handlungsformen der Verwaltung\n1. Formelle Rechtmäßigkeit von belastenden Verwaltungsakten\n- Zuständigkeit, Verfahren, Form\n- Verfahrensfehler und ihre Folgen (§§ 44-46 VwVfG)\n\nLehr- und Lernformen/ Methoden/ Medienformen\n\nPräsenzstudium: seminaristischer Unterricht\n\nSelbststudium: Vor- und Nachbereitung, Prüfungsvorbereitung\n"
    },
    "BAPuMa_M5_U3": {
      "airtable_id": "recVrE3BK4cuBvo03",
      "title": "Projektmanagement (PJM)",
      "module_id": "BAPuMa_M5",
      "module_record_id": "recIi7aOsHk0fb4Nh",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- Charakteristika verschiedener Projekttypen und verstehen die Wirkung von Grundsätzen erfolgreicher Projektmanagements; sie können Vorhaben als Projekte klassifizieren und verschiedene Phasen von Projekten bestimmen\n- typische Phasen von Projekten, deren Aufgaben und mögliche Probleme; sie können insbesondere die Projektvorbereitungsphase inhaltlich gestalten,\n- alternative Formen der Projektorganisation mit ihren Vor- und Nachteilen,\n- grundlegende Methoden und Werkzeuge, die in den Projektphasen angewendet werden können,\n- Anforderungen aus dem Umgang mit Komplexität und Projektrisiken,\n- die Bedeutung der Projektdokumentation und Erfolgskontrolle.\n### Methodenkompetenz\n- für Projekte relevante Informationen sammeln und sie kritisch hinterfragen,\n- Stakeholder- und Risikoanalysen durchführen,\n- Projektmanagementtechniken systematisch anwenden,\n- Fallstudien zielgerichtet bearbeiten,\n- ihre Arbeitsergebnisse schriftlich und mündlich präsentieren.\n### Selbstkompetenz\nDie Studierenden\n- können produktive Gruppendiskussionen führen,\n- entwickeln Sensibilität für die Komplexität und Herausforderungen von Projektarbeit inklusive der Frage von Projektabbrüchen als Option,\n- nehmen Probleme von Projektarbeit in hierarchisch strukturierten Organisationen wahr,\n- können persönliche Verhaltensweisen und Einschätzungen vor dem Hintergrund verhaltensökonomischer Erkenntnisse kritisch reflektieren; sie reflektieren Projekte in der Praxis und die eigene Rolle in Projekten kritisch,\n- können Ergebnisse schriftlich und mündlich präsentieren.\n",
      "content": "- Projekte und Projekttypen,\n- Nationale und internationale Standards und Projektgrundsätze\n- Stakeholder- und Risikoanalyse\n- Projektphasen und Prozesse innerhalb des Projektmanagements\n- Projektmanagementtechniken\n- Organisatorische Einbindung und Gestaltung von Projekten\n- Projekte als Instrument des Changemanagements\n- De-Biasing Techniken im Rahmen von Projektplanung und -durchführung\n"
    },
    "BAPuMa_M8_U2": {
      "airtable_id": "recVtu178yYHX7eNw",
      "title": "Verwaltung, Staat und Gesellschaft II",
      "module_id": "BAPuMa_M8",
      "module_record_id": "rec4eLwdR4hMOCALc",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- verstehen Zusammenhänge zwischen Gesellschaft und Staat,\n- kennen Aufgaben und Strukturen von Verwaltung in verschiedenen politischen Regimen und\n- kennen die verschiedenen Systemrationalitäten von Verwaltung, Politik und Medien.\n### Methodenkompetenz\nDie Studierenden\n- können sozialwissenschaftliche Ansätze für die Analyse von Handlungen, Handlungsbedingungen und Strukturen nutzen.\n### Sozialkompetenz\nDie Studierenden\n- können sich kritisch und sachlich mit unterschiedlichen Perspektiven auf bzw. Positionen zu gesellschaftlichen Entwicklungen auseinandersetzen.\n### Selbstkompetenz\nDie Studierenden\n- können ihre beruflichen Aufgaben und Rollen im Kontext gesellschaftlicher und politischer Anforderungen reflektieren und\n- können kontext- und situationsspezifisch professionell handeln.\n",
      "content": "- Gesellschaft und Gesellschaftstheorie\n- Aufgaben und Strukturen von Verwaltung in verschiedenen politischen Regimen\n- Verwaltungskritik und Leitbilder einer modernen Verwaltung\n- Systemrationalitäten von Verwaltung, Politik, Medien\n- sozialer Wandel: aktuelle gesellschaftliche und politische Entwicklungen\n"
    },
    "BAPuMa_M7_U1": {
      "airtable_id": "recWXC2Jw8CEr6R9l",
      "title": "Zivilrecht I",
      "module_id": "BAPuMa_M7",
      "module_record_id": "rec5UDQzlWK6DZnpE",
      "semester": 1,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Grundbegriffe und -strukturen des Allgemeinen Teils des BGB (BGB AT) sowie des Rechts der beweglichen Sachen (Mobiliarsachenrecht) zu beschreiben und anzuwenden, um leichte bis mittelschwere Fälle aus dem BGB AT und dem Mobiliarsachenrecht zu lösen.\n- die Regelungstechnik und den Anspruchsaufbau des BGB sowie wesentliche Rechtsinstitute aus dem BGB AT und dem Mobiliarsachenrecht zu erläutern.\n### Methodenkompetenz\n- anhand der erworbenen Strukturkenntnisse unbekannte zivilrechtliche Sachverhalte einzuordnen\n- und ggf. einer Lösung zuführen\n### Sozialkompetenz\n- die Bedeutung des Zivilrechts für die Gesellschaft und die öffentliche Verwaltung einzuschätzen und das Zivilrecht korrekt anzuwenden.\n- können Konfliktsituationen in rechtliche Formen (prozeduraler und inhaltlicher Art) zu erfassen und\n- entsprechende  Konfliktlagen  letztlich  rechtlich  zutreffend,  transparent  und  für  die  Betroffenen nachvollziehbar entscheiden.\n### Selbstkompetenz\n- die Methoden und Techniken der Rechtsanwendung auf den Gebieten des Privatrechts in ihrer Relevanz zu erkennen und anzuwenden,\n- vorfindliche Rechtsansichten kritisch und methodengerecht zu analysieren, ggfs. zu bestätigen oder begründet und nachvollziehbar zu widerlegen.\n",
      "content": "- Geschichte, Aufbau und Regelungstechnik des BGB\n- Trennungs- und Abstraktionsprinzip\n- Willenserklärung und Rechtsgeschäft\n- Zustandekommen von Verträgen\n- Recht der Allgemeinen Geschäftsbedingungen (AGB-Recht)\n- Willensmängel und deren Folgen, insb. Anfechtung\n- (Sonstige) Unwirksamkeitsgründe\n- Recht der Stellvertretung\n- Rechtsfolgen gescheiterter Verträge (Schadensersatz; Rückabwicklung)\n- Grundbegriffe des Mobiliarsachenrechts (Sachbegriff; Eigentumserwerb und -verlust; dingliche Herausgabeansprüche; Pfandrechte; Sicherungsübereignung)\n"
    },
    "BAPuMa_M6_U2": {
      "airtable_id": "recXDXhhOtpvnx2fm",
      "title": "Staats- und Europarecht I (StEuR I)",
      "module_id": "BAPuMa_M6",
      "module_record_id": "recNYZE75ahBg2COj",
      "semester": 1,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Grundlagen des Staatsorganisationsrechts,\n- Grundlagen des EU-Rechts: historische Entwicklung und aktuelle Bedeutung,\n- die Grundrechte hinsichtlich ihrer Funktionen, Geltung und Bedeutung,\n- die staatlichen Grundprinzipien des Grundgesetzes und wissen diese im Rahmen des Verwaltungshandelns zu berücksichtigen.\n### Methodenkompetenz\n- einfache bis mittelschwere staats- und verfassungsrechtliche Fälle unter Heranziehung der einschlägigen Vorschriften in nachvollziehbarer und vertretbarer Weise zu lösen.\n### Sozialkompetenz\n- Bürger_innen sowie Kolleg_innen bzw. Vorgesetzten die Wertentscheidungen des Grundgesetzes bei verwaltungsrechtlichen Maßnahmen vermitteln,\n- Bürger\\*innen den Einfluss des Staats- und Verfassungsrechts erläutern.\n### Selbstkompetenz\n- den Einfluss des Staats-, Europa- und Konventionsrechts im Rahmen des Verwaltungsverfahren sicher umsetzen,\n- die Verfassungs-, Europarechtskonformität von verwaltungsrechtlichen Maßnahmen beurteilen,\n- unbestimmte Rechtsbegriffe und Ermessensentscheidungen verfassungs-, europa- und europarechtskonform auslegen bzw. treffen und begründen.\n",
      "content": "1. Grundbegriffe des Staats- und Verfassungsrechts sowie des Europarechts und Konventionsrechts\n- Begriff des Staates\n- Staatszugehörigkeit\n- Funktionen der Verfassung\n- Rang der Verfassung\n- Abgrenzung und Verhältnis zum EU-Recht und zur EMRK\n1. Entstehung und Entwicklung des Grundgesetzes\n- Historische Grundlagen des Grundgesetzes\n- Paulskirchenverfassung und Reichsverfassungen\n- Herrenchiemseer Verfassungskonvent und Parlamentarischer Rat\n- Verfassungsreformen im Nachkriegsdeutschland\n"
    },
    "BAPuMa_M1_U1": {
      "airtable_id": "recXMVFHr6lBLS5ZJ",
      "title": "Betriebswirtschaftslehre der öffentlichen Verwaltung I (BÖV I)",
      "module_id": "BAPuMa_M1",
      "module_record_id": "recuZwpfs5f4QZRyW",
      "semester": 1,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- erkennen grundlegende Begriffe und Konzepte der Betriebswirtschafts- bzw. Managementlehre für die öffentliche Verwaltung.\n- kennen Managementinstrumente bzw. -verfahren.\n- kennen die Reformansätze des New Public Management.\n### Methodenkompetenz\n- die Verwaltung als kundenorientierten Dienstleister begreifen, anderen vermitteln und auf dieser Grundlage Problemlösungsvorschläge entwickeln,\n- eine betriebswirtschaftliche Perspektive auf das Verwaltungshandeln einnehmen, diese einordnen und anwenden.\n- effektive und effiziente Prozesse vorschlagen unter Anwendung von betriebswirtschaftlichen Modellen wie Total Quality Management und Lean Management.\n### Sozialkompetenz\n- grundlegende Herausforderungen und Ansatzpunkte für betriebswirtschaftliches Handeln im Verwaltungskontext zu kommunizieren.\n### Selbstkompetenz\n- sich in Neues einzuarbeiten und die Bedeutung verschiedener BWL-Aspekte für ihre Aufgabenerfüllung zu bewerten.\n",
      "content": "- Grundbegriffe, Konzepte und Problemstellungen der Betriebswirtschaftslehre\n- betriebswirtschaftliche Theorieansätze und deren Bedeutung für die öffentliche Verwaltung\n- Entwicklungen und Ziele des New Public Managements\n- Methoden zur Effizienz- und Effektivitätsmessung und -steigerung in der öffentlichen Verwaltung\n- Grundlagen des Verwaltungsmarketings und des Dienstleistungsmanagements\n"
    },
    "BAPuMa_M1_U2": {
      "airtable_id": "recXcuW01zjD8v4IX",
      "title": "Verwaltung, Staat und Gesellschaft I",
      "module_id": "BAPuMa_M1",
      "module_record_id": "recuZwpfs5f4QZRyW",
      "semester": 1,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- verstehen zentrale sozialwissenschaftliche Ansätze zur Erklärung von Handeln und\n- kennen Grundlagen der Sozialstrukturanalyse.\n### Methodenkompetenz\n- sozialwissenschaftliche Ansätze für die Analyse von Handlungen, Handlungsbedingungen und Strukturen nutzen.\n### Sozialkompetenz\n- sich kritisch und sachlich mit unterschiedlichen Perspektiven auf bzw. Positionen zu gesellschaftlichen Entwicklungen auseinandersetzen.\n### Selbstkompetenz\n- ihre eigene Situation und Stellung in der Gesellschaft sowie gesellschaftliche Entwicklungschancen und -risiken reflektieren und\n- kontext- und situationsspezifisch professionell handeln.\n",
      "content": "- Gegenstand und Aufgabe der Sozialwissenschaften in der Verwaltungsausbildung\n- sozialwissenschaftliche Ansätze des Verstehens und Erklärens von Handeln und Strukturen\n- soziale Ungleichheit und soziale Mobilität\n- sozialer Wandel: aktuelle gesellschaftliche Entwicklungen\n"
    },
    "BAPuMa_M13_U2": {
      "airtable_id": "recYThP7vZxAjcTVR",
      "title": "Eignungsdiagnostik und Personalentwicklung (PE)",
      "module_id": "BAPuMa_M13",
      "module_record_id": "recxZKUcUxaQlQkjR",
      "semester": 4,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- Formen und Modelle von Personalentwicklung und Karriereplanung und\n- Eignungsdiagnostische Verfahren und Vorgehensweisen\n- Standards und Kriterien für die Bewertung von Personalauswahl- und -fortbildungsmaßnahmen.\n### Methodenkompetenz\n- Personalentwicklungsbedarfe im Kontext organisatorischer Zielsetzungen identifizieren und\n- die Qualität eignungsdiagnostischer Instrumente bewerten.\n### Sozialkompetenz\n- Mitarbeiter\\*innen und Führungskräfte bei der Auswahl geeigneter Personalentwicklungsmaßnahmen und/oder Instrumenten der Eignungsdiagnostik beraten und unterstützen.\n### Selbstkompetenz\nDie Studierenden entwickeln\n- ein Verständnis von Personalentwicklung/Eignungsdiagnostik als integralem Bestandteil organisationaler Zielsetzungen und\n- eine Haltung gegenüber internen und externen Maßnahmen der Personalentwicklung/ Eignungsdiagnostik, die zur Professionalisierung der Nutzung entsprechenden Angebote beiträgt.\n",
      "content": "- Grundlagen der Personalentwicklung\n- Varianten von Fort- und Weiterbildung\n- Digitales Lernen und Lehren\n- Grundlagen der Eignungsdiagnostik\n- Instrumente der Eignungsdiagnostik\n- Kriterien zur Bewertung externer Angebote\n"
    },
    "BAPuMa_M5_U2": {
      "airtable_id": "recYrrfZjQ0cLBmQW",
      "title": "Grundlagen des E-Governments (EGov)",
      "module_id": "BAPuMa_M5",
      "module_record_id": "recIi7aOsHk0fb4Nh",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- kennen IT-Infrastrukturen, die Unterscheidung von Intranet und Internet sowie Kollaborationsplattformen,\n- kennen Konzepte und aktuelle Rahmenbedingungen (z.B. OZG) der Digitalisierung und besitzen die Kenntnisse, um an daraus erwachsenden Aufgaben mitarbeiten zu können,\n- kennen Kriterien zum Vergleich verschiedener Digitalisierungsstrategien.\n### Methodenkompetenz\n- Softwareplattformen zur Kollaboration einsetzen.\n### Sozialkompetenz\n- sich im Kontext der Fachanwendungen sowohl mit Kolleg\\*innen der eigenen wie anderer Institutionen als auch mit IT-Dienstleistern zu vernetzen und konstruktiv an übergreifenden Projekten mitzuarbeiten.\n### Selbstkompetenz\nDie Studierenden\n- können Lösungsansätze im Rahmen der Digitalisierung von Verwaltungsprozessen einschätzen.\n- kennen IT-Fachterminologie im Kontext der Digitalisierung als Grundlage zur Diskussion mit Kolleg_innen, Kund_innen und IT-Dienstleistern\n",
      "content": "- Aufbau und Funktionsweise des Internets\n- Funktionsweise von Suchmaschinen\n- SharePoint als Instrument der Kollaboration\n- Varianten des E-Governments\n- o E-Administration\n- o E-Democracy\n- Interaktions- und Kommunikationsformen\n- Digitalisierung der Verwaltung\n- o Zielsetzungen,\n- o Rechtliche und institutionelle Rahmenbedingungen (z.B. OZG)\n- o Aktuelle Entwicklungen\n- o Herausforderungen und Lösungsansätze\n- o Vergleich der Ansätze in Hamburg und anderen Städten\n- Digitale Stadt\n- o Umsetzungsstrategien im Städtevergleich\n"
    },
    "BAPuMa_M9_U2": {
      "airtable_id": "recZnK193kItlRSoj",
      "title": "",
      "module_id": "BAPuMa_M9",
      "module_record_id": "rec3sQTsc1Dlo1K21",
      "semester": "",
      "sws": "",
      "workload": "",
      "lehrsprache": "",
      "learning_outcomes_text": "",
      "content": ""
    },
    "BAPuMa_M20H_U2": {
      "airtable_id": "recaoACUwqgNQclw0",
      "title": "Controlling",
      "module_id": "BAPuMa_M20H",
      "module_record_id": "reccwfWvbK2STQFCQ",
      "semester": 5,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n## Die Studierenden\n- haben ein fundiertes verwaltungsspezifisches Controllingverständnis mit Bezügen zur Rationalitätssicherung\n- verstehen den Kreislauf von Planung, Steuerung und Kontrolle\n- kennen die Unterschiede und Wechselwirkungen zwischen operativem und strategischem Controlling\n- kennen Aufgaben und Strukturen eines Berichtswesens\n- kennen Controllingaufgaben im Rahmen der Planung, Budgetierung, Kontrolle, Informationsversorgung und Rationalitätssicherung\n- verstehen die Bedeutung von Metaplanungen für die Umsetzung von Steuerungskonzepten.\n### Methodenkompetenz\n## Die Studierenden können\n- ausgewählte Steuerungsmethoden in der Praxis anwenden, erforderlichen Informationsbedarf identifizieren und Ergebnisse interpretieren,\n- strukturelle Rahmenbedingungen der öffentlichen Verwaltung und passende Verfahren auf einander abstimmen und ausgewählte Methoden auf Besonderheiten des öffentlichen Sektors anpassen,\n- Berichte strukturieren und interpretieren und dabei Spezifika des öffentlichen Sektors berücksichtigen,\n- Ansatzpunkte für die Rationalitätssicherung von Steuerungsprozessen proaktiv und reaktiv identifizieren,\n- Zielkonflikte bei Verwaltungsentscheidungen einordnen und ihre Entwicklung vor dem Hintergrund von kurzfristiger und langfristiger Wirtschaftlichkeit einordnen.\n### Sozialkompetenz\n## Die Studierenden\n- erkennen Zusammenhänge zwischen zentralen und dezentralen Entscheidungen sowie strategischer und operativer Planung,\n- haben ein sicheres Verständnis für Möglichkeiten und Grenzen der Koordination,\n- können ihr Verhalten vor dem Hintergrund von Anforderungen störungsfreier Steuerungsprozesse und Verwaltungsabläufe bewerten.\n### Selbstkompetenz\n## Die Studierenden\n- kennen die Bedeutung einer Analyse der Ausgangssituation für situationsadäquate Steuerungsansätze für eine wirtschaftliche Verwaltungssteuerung,\n- erkennen die Bedeutung eines theoretisch fundierten Transfers von betriebswirtschaftlichen Steuerungskonzepten angesichts von Spezifika der öffentlichen Verwaltung,\n- entwickeln Voraussetzungen und Bereitschaft, persönliche Verhaltensweisen vor dem Hintergrund behavioristischer Erkenntnisse kritisch zu reflektieren.\n\n| Inhalte der Unit • Grundverständnis des Controllings: Information, Koordination, Rationalitätssicherung; Rahmenbedingungen und Spezifika des Verwaltungscontrollings • Controlling als Regelkreislauf und Überlagerung mit dem Haushaltskreislauf • Ziele und Zielsysteme der öffentlichen Verwaltung und daraus abgeleitete Steuerungsmodelle • Steuerungsgrößen der strategischen und operativen Planung und damit verbundene Kennzahlen und Kennzahlensysteme; Spezifika des öffentlichen Sektors • Betriebswirtschaftliches Berichtswesen; Spezifika des öffentlichen Sektors • Ausgewählte Konzepte und Methoden einer Steuerung von Ressourcen und von   | Inhalte der Unit • Grundverständnis des Controllings: Information, Koordination, Rationalitätssicherung; Rahmenbedingungen und Spezifika des Verwaltungscontrollings • Controlling als Regelkreislauf und Überlagerung mit dem Haushaltskreislauf • Ziele und Zielsysteme der öffentlichen Verwaltung und daraus abgeleitete Steuerungsmodelle • Steuerungsgrößen der strategisch\n",
      "content": "•  Grundverständnis des Controllings: Information, Koordination, Rationalitätssicherung;\nRahmenbedingungen und Spezifika des Verwaltungscontrollings\n• Controlling als Regelkreislauf und Überlagerung mit dem Haushaltskreislauf\n• Ziele und Zielsysteme der öffentlichen Verwaltung und daraus abgeleitete Steuerungsmodelle\n• Steuerungsgrößen der strategischen und operativen Planung und damit verbundene\nKennzahlen und Kennzahlensysteme; Spezifika des öffentlichen Sektors\n• Betriebswirtschaftliches Berichtswesen; Spezifika des öffentlichen Sektors\n• Ausgewählte Konzepte und Methoden einer Steuerung von Ressourcen und von\nFixkostenblöcken\n• Ansätze der Rationalitätssicherung in Steuerungsprozessen der öffentlichen Hand\n"
    },
    "BAPuMa_M20S_U2": {
      "airtable_id": "recc1IDRFctflGjue",
      "title": "Soziale Ungleichheit und Stadtstruktur",
      "module_id": "BAPuMa_M20S",
      "module_record_id": "rec3p8EUNSA8AsoFL",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- können Zusammenhänge zwischen sozialen, ökonomischen und sozialräumlichen Entwicklungen herstellen und reflektieren sowie\n- theoretische und empirische Ansätze zur residentiellen Segregation verstehen.\n### Methodenkompetenz\n- verschiedene Segregationsindices bewerten und anwenden sowie\n- sozialräumliche Entwicklungen erkennen und bewerten.\n### Sozialkompetenz\n- sich mit wechselnden Kooperationspartner_innen - unterschiedlichen Behörden, Berufsgruppen, Anwohner_innen usw. - über theoretische und empirische Erkenntnisse über sozialräumliche Entwicklungen austauschen und\n- gemeinsam mit diesen Kooperationspartner\\*innen Lösungsvorschläge für sozialräumliche Problemlagen entwickeln.\n### Selbstkompetenz\n- aus der Diagnose sozialräumlicher Problemlagen wissenschaftlich begründete Entwicklungsvorschläge ableiten.\n",
      "content": "- soziale und ethnische Segregation\n- Gentrifizierung\n- Ansätze und Methoden der Stadt- und Quartiersentwicklung\n"
    },
    "BAPuMa_M19I_U1": {
      "airtable_id": "reccC4GdUu8RQYg1f",
      "title": "Hamburg im internationalen Standortwettbewerb",
      "module_id": "BAPuMa_M19I",
      "module_record_id": "recBDLpuh4HEcvtI1",
      "semester": 5,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n## Die Studierenden\n- haben ihr vorhandenes Wissen im Bereich regional-, stadt- und handelsökonomischer Grundlagen vertieft und können dieses auf den Wirtschaftsstandort Hamburg anwenden,\n- kennen und verstehen aktuelle Strategien zur Förderung des Wirtschaftsstandortes sowie regional- und strukturpolitische Entwicklungen der Freien und Hansestadt Hamburg im Kontext internationaler Arbeitsteilung und europäischer Binnenmarktintegration,\n- können standortpolitische Unternehmensentscheidungen aus einer betriebswirtschaftlichen Perspektive nachvollziehen und verstehen entsprechende Analysemethoden.\n### Methodenkompetenz\n- Wirtschaftsstandorte sowie unternehmerische bzw. betriebliche Standortentscheidungen mit unterschiedlichen Methoden zu analysieren,\n- Schlussfolgerungen aus den Kenntnissen unternehmerischer Standortentscheidungen und Strategien für die Standortpolitik öffentlicher Gebietskörperschaften zu ziehen,\n- (Standort-)Wettbewerbssituationen zu analysieren und daraus Erfolgs- bzw. Handlungspotenziale abzuleiten,\n- Instrumente staatlicher und kommunaler Standortpolitik zu bewerten und einzusetzen.\n### Sozialkompetenz\n- Ansprechpersonen verschiedener Institutionen und Stellen mit Bezug zu standortpolitischen Inhalten zu identifizieren und deren institutionellen Hintergrund zu verstehen, was ihnen eine zielführende Kommunikation mit denselben erleichtert,\n- gemeinsam mit anderen an Problemlösungen zu arbeiten.\n### Selbstkompetenz\n- unternehmerische Standortentscheidungen so zu analysieren und zu vermitteln, dass sie bei der Entwicklung standortpolitischer Strategien öffentlicher Gebietskörperschaften angemessen und erfolgsorientiert berücksichtigt werden können,\n- staatliche und kommunale Entscheidungen zur Standortpolitik anzuwenden und bei Bürger\\*innen sowie der Privatwirtschaft ein Verständnis hierfür zu schaffen,\n- Entscheidungen zur Förderung von Wirtschaftsstandorten so zu erklären, dass sie inhaltlich akzeptiert und nachvollzogen werden können,\n- gegenüber relevanten Akteuren aus Privatwirtschaft, Politik und Verwaltung überzeugend und kompetent aufzutreten.\n",
      "content": "- Standortfaktoren und Wirtschaftsstandort Hamburg\n- Standortentscheidungen aus Unternehmensperspektive\n- Standortstrategien aus Perspektive öffentlicher Gebietskörperschaften\n- Analysemöglichkeiten der Wettbewerbssituation von Kommunen und Regionen\n- Instrumente staatlicher und kommunaler Standortförderung\n- Wirtschaftsförderung und Standortpolitik Hamburgs\n- Aktuelle Trends und Entwicklungen\n"
    },
    "BAPuMa_M18_U2": {
      "airtable_id": "reccKfUuxkLMSpaO2",
      "title": "",
      "module_id": "BAPuMa_M18",
      "module_record_id": "recun8SD5VwOd2ncV",
      "semester": "",
      "sws": "",
      "workload": "",
      "lehrsprache": "",
      "learning_outcomes_text": "",
      "content": ""
    },
    "BAPuMa_M20P_U1": {
      "airtable_id": "reccVafg99wj6dbb1",
      "title": "Beamtenrecht (BeamtR)",
      "module_id": "BAPuMa_M20P",
      "module_record_id": "reciiD6VPiR3lg0s4",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Rechtsverhältnisse der im öffentlichen Dienst Beschäftigten zu überblicken,\n- fallbezogen im rechtlich-strukturierten Rahmen im Beamtenrecht personalrelevante Entscheidungen  insbesondere  auch  unter  Anwendung  der  Grundlagen  der  Rechtsmethodik (siehe Modul 2 Unit 1) zu treffen.\n### Methodenkompetenz\n- die Strukturen des Beamtenrechts überblicken und - ggfs. auch vertieft - erläutern,\n- die für den Einzelfall maßgeblichen Vorschriften des Beamtenrechts ermitteln, sie ggfs. auslegen und auf den Einzelfall anwenden,\n- die getroffenen Entscheidungen überzeugend (zu) begründen.\n### Sozialkompetenz\n- das eigene Dienstrechtsumfeld (Beamtenrecht im Rahmen der Normenpyramide) zu erkennen,\n- die gegenläufigen Interessen in einem Arbeitsteam auch in ihren außerrechtlichen Implikationen zu erkennen,\n- Konfliktsituationen in rechtliche Formen (prozeduraler und inhaltlicher Art) zu fassen und\n- entsprechende  Konfliktlagen  letztlich  rechtlich  zutreffend,  transparent  und  für  die  Betroffenen nachvollziehbar zu entscheiden.\n### Selbstkompetenz\n- die Methoden und Techniken der Rechtsanwendung auf dem Gebiet des Beamtenrechts in ihrer Relevanz erkennen und anwenden,\n- vorfindliche Rechtsansichten kritisch und methodengerecht analysieren, ggfs. bestätigen oder begründet und nachvollziehbar widerlegen.\n",
      "content": "Vertiefung der beamtenrechtlichen Themen aus dem Modul 7 Zivilrecht und Personalrecht, Unit 2 und Unit 4; spezielle Problemstellungen\n- Verfassungsrechtsfragen des Beamtenrechts, insbesondere Art. 33 GG\n- Begründung, sonstige Ernennungen; Rücknahme und Nichtigkeit von Ernennungen; amtsrechtliche Veränderungen\n- Beendigung des Beamtenverhältnisses\n- Laufbahnrecht der Beamtinnen und Beamten: Laufbahnverordnung, Laufbahnprinzip, Laufbahngruppen\n"
    },
    "BAPuMa_M14_U1": {
      "airtable_id": "reccbxQ0aUejkuk4k",
      "title": "Deutsche und europäische Grundrechte (Staats- und Europarecht III)",
      "module_id": "BAPuMa_M14",
      "module_record_id": "rechEoBiLibBbh92m",
      "semester": 4,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n,\n- die Grundrechte des Grundgesetzes,\n- die Grundrechte der Europäischen Grundrechtecharta (GRC),\n- die Gewährleistungen der Europäischen Menschenrechtskonvention (EMRK) und anderer wichtiger völkerrechtlicher Verträge.\n- den Einfluss dieser Rechtskreise und Prinzipien im Rahmen des\n- Verwaltungshandelns.\n### Methodenkompetenz\n- mittelschwere staats- und verfassungsrechtliche Fälle unter Einbeziehung des EURechts und des Konventionsrechts in nachvollziehbarer und vertretbarer Weise zu lösen.\n### Sozialkompetenz\n- Bürger_innen sowie Kolleg_innen bzw. Vorgesetzten die Wertentscheidungen des Grundgesetzes, des EU-Rechts und des Konventionsrechts bei verwaltungsrechtlichen Maßnahmen vermitteln,\n- Bürger\\*innen den Einfluss des Staats- und Verfassungsrechts sowie des EURechts und des Konventionsrechts erläutern.\n### Selbstkompetenz\n,\n- den Einfluss des Staats-, Europa- und Konventionsrechts im Rahmen des Verwaltungsverfahren sicher umsetzen,\n- die Verfassungs-, Europa- und Konventionskonformität von verwaltungsrechtlichen Maßnahmen beurteilen,\n- unbestimmte Rechtsbegriffe und Ermessensentscheidungen verfassungs-, europaund konventionskonform auslegen bzw. treffen und begründen.\n",
      "content": "1. Allgemeine Grundrechtslehren (Wiederholung)\n2. Einzelne Grundrechte des Grundgesetzes\n- Schutz der Menschenwürde und des Lebens\n- Recht auf freie Entfaltung der Persönlichkeit\n- Spezielle Freiheitsgrundrechte\n- Antidiskriminierung\n"
    },
    "BAPuMa_M19D_U1": {
      "airtable_id": "reccqCp0VmQCG1At6",
      "title": "IT-Aspekte der Digitalisierung II (ITD2)",
      "module_id": "BAPuMa_M19D",
      "module_record_id": "rec4rbFis4aFep4mv",
      "semester": 5,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Grundlagen der Programmierung und sind in der Lage, selbständig einfache Anwendungen oder Apps zu entwickeln und sich in komplexere Anwendungen und ihre Kontexte einzuarbeiten\n- verschiedene Methoden der Softwareentwicklung\n- Anwendungsbereiche der KI in der Öffentlichen Verwaltung\n### Methodenkompetenz\n- grundlegend mit einer Programmierumgebung und einer Programmiersprache umzugehen\n- Mechanismen der Softwareverteilung, Inbetriebnahme und des Betriebs zu unterstützen\n- Varianten des Softwareentwicklungsprozesses zu unterscheiden und zu beurteilen\n### Sozialkompetenz\n- im Kontext der Digitalisierung von Prozessen terminologisch sicher mit IT-Fachleuten zusammenzuarbeiten\n### Selbstkompetenz\n- an der Digitalisierung von Prozessen mitwirken.\n",
      "content": "- Einführung in die Programmierung (exemplarisch anhand einer Programmiersprache)\n- Der Softwareentwicklungsprozess\n- o Vorgehensmodelle\n- o Agile Softwareentwicklung\n- Einführung in das IT-Servicemanagement\n- o Lebenszyklus von Anwendungen und Diensten\n- Analyse von Anwendungsbereichen der KI in der Öffentlichen Verwaltung\n- Erarbeitung von Fallbeispielen zur Digitalisierung von Prozessen\n"
    },
    "BAPuMa_M6_U4": {
      "airtable_id": "recfF0ZWH26y7wHu7",
      "title": "Staats- und Europarecht II (StEuR II)",
      "module_id": "BAPuMa_M6",
      "module_record_id": "recNYZE75ahBg2COj",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Staatsziele des Grundgesetzes,\n- die Grundprinzipien des Grundgesetzes und der Europäischen Union,\n- europäische Grundrechte in ihren Grundzügen (allgemeiner Überblick; historische Entwicklung; Einfluss auf das nationale Recht), und wissen diese im Rahmen des Verwaltungshandelns zu berücksichtigen.\n### Methodenkompetenz\n- einfache bis mittelschwere staats- und verfassungsrechtliche Fälle unter Heranziehung der einschlägigen Vorschriften in nachvollziehbarer und vertretbarer Weise zu lösen.\n### Sozialkompetenz\n- Bürger_innen sowie Kolleg_innen bzw. Vorgesetzten die Wertentscheidungen des Grundgesetzes bei verwaltungsrechtlichen Maßnahmen vermitteln,\n- Bürger\\*innen den Einfluss des Staats- und Europarechts, insbesondere der Grundrechte, erläutern.\n### Selbstkompetenz\n- den Einfluss des Staats-, EU- und Konventionsrechts im Rahmen des Verwaltungsverfahren sicher umsetzen,\n- die Verfassungs-, EU- und Konventionskonformität von verwaltungsrechtlichen Maßnahmen beurteilen,\n- unbestimmte Rechtsbegriffe und Ermessensentscheidungen verfassungs-, EU- und konventionskonform auslegen bzw. treffen und begründen.\n",
      "content": "1. Bundesstaatsprinzip\n- Geschichtliche Entwicklung\n- Begriff und Wesen des Bundesstaates\n- Verteilung der Gesetzgebungs- und Verwaltungskompetenzen zwischen Bund und Ländern\n- Finanzverfassung\n"
    },
    "BAPuMa_M16_U3": {
      "airtable_id": "recgvgBrATtK93gyd",
      "title": "Allgemeines Verwaltungsrecht IV",
      "module_id": "BAPuMa_M16",
      "module_record_id": "receirLz0E0zoTzxX",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- den einstweiligen Rechtsschutz vor dem Verwaltungsgericht,\n- die Aufhebungsregeln für Verwaltungsakte,\n- die begleitenden Regelungen zu diesen Normen.\n### Methodenkompetenz\nin  den  genannten Rechtsgebieten mittelschwere Fälle unter Heranziehung der einschlägigen Vorschriften plausibel zu lösen.\n### Sozialkompetenz\n- Betroffene und Kolleg\\*innen über den einstweiligen Rechtsschutz informieren,\n- Fragen der Bürger\\*innen hinsichtlich der Aufhebung von Verwaltungsakten beantworten,\n- Kolleg\\*innen sowie Vorgesetzte zu diesen Fragen beraten.\n### Selbstkompetenz\n- die Erfolgsaussichten eines einstweiligen Rechtsschutzverfahrens einschätzen,\n- rechtswidrige Verwaltungsakte zurücknehmen,\n- rechtmäßige Verwaltungsakte widerrufen,\n- eventuell erforderliche Rückforderungsbescheide erstellen sowie\n- die Rechtmäßigkeit bzw. Rechtswidrigkeit der genannten Maßnahmen beurteilen.\n",
      "content": ""
    },
    "BAPuMa_M20H_U3": {
      "airtable_id": "rechRxwe3hRaVONWT",
      "title": "SAP",
      "module_id": "BAPuMa_M20H",
      "module_record_id": "reccwfWvbK2STQFCQ",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n## Die Studierenden\n- verstehen die Architektur einer betriebswirtschaftlichen Standardanwendung (ERP-System) und erkennen den Zusammenhang der ERP-Architektur zu übergeordneten Geschäftsprozessen,\n- kennen die Funktionsprinzipien der Standardsoftware SAP und beherrschen die grundlegende Systemnavigation von SAP.\n### Methodenkompetenz\n## Die Studierenden\n- sind in der Lage, selbständig Transaktionen in SAP zu erklären und abzubilden.\n### Sozialkompetenz\nDie Studierenden\n- können ihr Verhalten bei der Nutzung von ERP-Systemen vor dem Hintergrund von Anforderungen störungsfreier Steuerungsprozesse und Verwaltungsabläufe bewerten.\n### Selbstkompetenz\n## Die Studierenden\n- erkennen die Verbindung von betriebswirtschaftlichen Steuerungskonzepten und ihrer Umsetzung in integrierter Standardsoftware.\n",
      "content": "- Einführung in Enterprise Resource Planning Systems (ERP-Systeme)\n- Grundlagen und Funktionsprinzipien der Standardsoftware SAP\n- Organisationsebenen und Datenarten in SAP\n- Grundlagen der Systembedienung und Navigation\n- Wichtige Abläufe im SAP-System\n- Sachkonten, Debitorenkonten und Kreditorenkonten\n- Prozesse im Rahmen der Hauptbuchhaltung, der Nebenbuchhaltung und Buchhaltungsbelege\n- Kostenarten-, Kostenstellen- und Kostenträgerrechnung in SAP\n- Prozesse im Rahmen der Kostenrechnung und Kostenrechnungsbelege\n- Wesentliche Berichte des Finanzwesens und des Controllings\n- Anwendungsbeispiele und Fallstudien\n"
    },
    "BAPuMa_M19D_U2": {
      "airtable_id": "rechoa27BDWkY6uyz",
      "title": "Steuerung der digitalen Transformation (SDT)",
      "module_id": "BAPuMa_M19D",
      "module_record_id": "rec4rbFis4aFep4mv",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- verstehen Digitalisierungsprozesse als strategisches Handlungs- und Gestaltungsfeld,\n- kennen strategische Herausforderungen, Barrieren und Erfolgsfaktoren des digitalen Transformationsprozesses,\n- kennen Ansätze für Anforderungsanalysen und zur Gestaltung digitaler Angebote für Bürger\\*innen, Unternehmen und Gesellschaft,\n- (er)kennen Potenziale zur Arbeits- und Organisationsgestaltung,\n- kennen spezifische Risiken in Digitalisierungsprojekten bzw. digitalisierter Prozesse.\n### Methodenkompetenz\nDie Studierenden\n- können Instrumente zu obengenannten Kompetenzfeldern einsetzen und Analysen durchführen,\n- können in ihrer Berufspraxis an der Entwicklung situationsadäquater Konzepte zu obengenannten Kompetenzfeldern mitwirken.\n### Sozialkompetenz\nDie Studierenden\n- können durch adäquate Kommunikation und Kooperation digitale Transformationsprozesse in der Berufspraxis vermitteln und die Akzeptanz mit fördern.\n### Selbstkompetenz\nDie Studierenden\n- entwickeln und vertreten ein strategie-geleitetes Verständnis digitaler Transformationsprozesse,\n- verstehen und vertreten digitale Transformation potenzialorientiert als einen aktiven Gestaltungsprozess.\n",
      "content": "- Strategische Ausrichtung digitaler Transformationsprozesse und Digitalisierungspotenziale\n- Nutzer\\*innenorientierte Gestaltungsansätze\n- Potenziale und Herausforderungen für Arbeits- und Organisationsgestaltung\n- Erfolgsfaktoren und Barrieren der (Steuerung der) digitalen Transformation\n- Nutzen-/Kostenbetrachtung\n"
    },
    "BAPuMa_M20D_U1": {
      "airtable_id": "reciyDE9kCuYbOAwH",
      "title": "Informationszugangs- und Datenschutzrecht",
      "module_id": "BAPuMa_M20D",
      "module_record_id": "recnpLQNRghK91kWq",
      "semester": 5,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- das Datenschutz- und Informationsfreiheitsrecht in das Rechtssystem einordnen und\n- fallbezogen im rechtlich-strukturierten Rahmen Entscheidungen insbesondere auch unter Anwendung der Grundlagen der Rechtsmethodik (siehe Modul 2 Unit 1) treffen.\n### Methodenkompetenz\n- die Strukturen Datenschutz- und Informationsfreiheitsrechts, auch in ihrem Zusammenwirken, überblicken und - ggfs. auch vertieft - erläutern,\n- die für den Einzelfall maßgeblich Vorschriften ermitteln, sie ggfs. auslegen und auf den Einzelfall anwenden und\n- die getroffenen Entscheidungen überzeugend begründen.\n### Sozialkompetenz\n- die Anforderungen des Datenschutz- und Informationsfreiheitsrechts miteinander verbinden und\n- unter Berücksichtigung auch außerrechtlicher Anforderungen interessengerechte Entscheidungen fällen.\n### Selbstkompetenz\n- die datenschutz- und informationsfreiheitsrechtlichen Anforderungen in ihren Arbeitsbereichen identifizieren und\n- vorfindliche Rechtsansichten kritisch und methodengerecht analysieren, ggfs. bestätigen oder begründet und nachvollziehbar widerlegen.\n",
      "content": "- Grundlagen des Datenschutz- und Informationsfreiheitsrechts\n- Rechtsquellen und Anwendungsbereich des Datenschutzrechts\n- Grundprinzipien des Datenschutzrechts, insbesondere Rechtmäßigkeit der Datenverarbeitung\n- Betroffenenrechte und Kontrolle der Datenverarbeitung\n- Rechtsquellen der Informationsfreiheit, insbesondere das Hamburgische Transparenzgesetz\n- Veröffentlichungs- und Auskunftspflichten als Ausprägungen der Informationsfreiheit\n"
    },
    "BAPuMa_M12_U1": {
      "airtable_id": "recjxleIHRMNGkegM",
      "title": "Öffentliche Finanzwirtschaft III",
      "module_id": "BAPuMa_M12",
      "module_record_id": "recOSHMVAP0cLNY70",
      "semester": 4,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- unter besonderer Einbeziehung der Budgetierung einen Haushaltsplan verstehen. Schwerpunkt des Verständnisses ist die Planungsphase,\n- den Haushaltskreislauf in den Grundzügen verstehen.\n### Methodenkompetenz\n- Haushaltsgrundsätze bei der Lösung von Fällen anwenden,\n- Nachforderung von Haushaltsmitteln in einem produktorientierten Haushalt durchsetzen.\n### Sozialkompetenz\n- haushalts- und finanzwirtschaftliche Vorschriften kommunizieren und bei den Bürger\\*innen ein Verständnis für die durchzuführenden Leistungen und Aufgaben öffentlicher Haushalte schaffen,\n- ihren künftigen Kolleg\\*innen nachhaltige Verhaltensweisen und haushaltsrechtliche Ansätze so vermitteln, dass sie inhaltlich akzeptiert und nachvollzogen werden.\n### Selbstkompetenz\n- geplante Änderungen im Haushaltsrecht in Richtung auf ein wirkungsorientiertes Rechnungswesen und damit zusammenhängende Probleme in das bestehende System des Produkthaushaltes integrieren,\n- die Aufgaben des klassischen Haushaltsrechts mit den Ansätzen einer produktorientierten Haushaltführung unter Einbeziehung betriebswirtschaftlicher Inhalte kritisch reflektieren.\n",
      "content": "- Einführung\n- Finanzierungsmittel: Steuern, Gebühren, Beiträge, Zuwendungen, Umlagen, Kredite\n- Der Haushaltsplan: Grundlagen, Gliederung nach Produkten, Elemente, Anlagen\n- Haushaltsgrundsätze: Allgemeine und Spezielle\n- Haushaltsplanung: Ergebnisplanung, Finanzplanung, Investitionsplanung, Planung der Kreditaufnahme und -tilgung, Verpflichtungsermächtigungen, Haushaltsausgleich, Budgetierung\n- Haushaltsbewirtschaftung\n- Nachtragshaushalt\n"
    },
    "BAPuMa_M19S_U1": {
      "airtable_id": "reclQ5b3JIwNmsfma",
      "title": "Sozialrecht (SozialR)",
      "module_id": "BAPuMa_M19S",
      "module_record_id": "recEcAt6TiZA6xkK7",
      "semester": 5,
      "sws": 4,
      "workload": "Präsenzstudium 68 h, Selbststudium 52 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- einen Überblick über das Sozialrecht zu geben und es in die Gesamtrechtsordnung einzuordnen,\n- die Strukturen und wesentlichen Zusammenhänge des SGB II (Grundsicherung für Arbeitssuchende) und SGB VIII (Kinder- und Jugendhilfe) wiederzugeben.\n### Methodenkompetenz\n- rechtliche Fragen sowie\n- mittelschwere Fälle aus den genannten Gebieten bearbeiten.\n### Sozialkompetenz\n- Antragstellerinnen und Antragsteller in Hinblick auf die Grundzüge der genannten Rechtsgebiete zu beraten,\n- sich rasch vertieft in eine sozialrechtliche Tätigkeit in der Praxis einzuarbeiten.\n### Selbstkompetenz\n- die Komplexität des Sozialrechts einschätzen und\n- verstehen seine große Bedeutung für die Bürger\\*innen sowie den Gesamtstaat.\n",
      "content": "- Einstieg und Überblick über die Entwicklung des deutschen Sozialrechts und seine wirtschaftliche Dimension\n- Sozialrecht in der Gesamtrechtsordnung\n- das sozialrechtliche Verfahren im Vergleich zum Verwaltungsverfahren\n- Grundsicherung für Arbeitssuchende (SGB II) - Anwendungsbereich - Leistungen Instrumente, insbesondere Eingliederungsvereinbarung - Sanktionen - Reformvorschläge\n- Kinder- und Jugendhilferecht (SGB VIII) - Geschichte - Aufgaben - Instrumente - Organisation und Finanzierung\n"
    },
    "BAPuMa_M19H_U1": {
      "airtable_id": "recmeQLwzQIONDyOy",
      "title": "Vergaberecht: Rechtlicher Rahmen",
      "module_id": "BAPuMa_M19H",
      "module_record_id": "reclqugd7eVoTmvAC",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Grundlagen des öffentliches Auftrags- und Beschaffungswesens,\n- die entsprechenden Rechtsvorschriften sowie\n- den Einfluss des EU-Rechts auf das Beschaffungs- und Vergaberecht.\n### Methodenkompetenz\n- einfache bis mittelschwere Fälle unter Heranziehung der einschlägigen Vorschriften in nachvollziehbarer und vertretbarer Weise lösen.\n### Sozialkompetenz\n- rechtliche Probleme und Risiken der öffentlichen Auftragsvergabe in der Behördenpraxis kommunizieren und mit Kolleg\\*innen und Vorgesetzten gemeinsam Lösungen zu deren Überwindung bzw. Prävention entwickeln.\n### Selbstkompetenz\n- Kolleg\\*innen bzw. Vorgesetzten Zweifelsfragen zum Beschaffungs- und Vergaberecht verständlich erläutern.\n",
      "content": "- Europa- und verfassungsrechtliche Grundlagen des Vergaberechts\n- allgemeine Grundsätze des Vergaberechts; Öffentliche Auftraggeber und Öffentliche Aufträge; Verfahrensarten, Wettbewerblicher Dialog, Vergabeverfahren, Vergabehandbücher, Nachprüfverfahren\n- haushaltsrechtliche Grundlagen des Zuwendungsrechts\n- Gesetz gegen Wettbewerbsbeschränkungen (GWB)\n- Haushaltsgesetze, Haushaltsordnungen\n- Vergabeverordnung (VgV)\n- Vergabe- und Vertragsordnung für Leistungen (VOL): Vergabeverordnung, Unterschwellenvergabeordnung (UVgO), Allgemeine Vertragsbedingungen für die Ausführung von Leistungen (VOL/B)\n- Vergabeverfahren\n- Abgrenzung zum Dienst-, Werk- und Kaufvertragsrecht nach BGB\n- Rechtsschutz\n"
    },
    "BAPuMa_M19P_U2": {
      "airtable_id": "recnba7lg7wiwVPHe",
      "title": "IT-Systeme zur Unterstützung des Personal- und Organisationsmanagements (ITPOM)",
      "module_id": "BAPuMa_M19P",
      "module_record_id": "rec0RrTuoPPydOzfz",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- kennen die Funktionalität von IT-Systemen zur Personal- und Ressourcenplanung und die Möglichkeit, mit ihrer Hilfe personelle Ressourcen zu steuern,\n- kennen IT-Instrumente im Bereich des Wissensmanagements,\n- haben einen Überblick über Möglichkeiten von KI-Methoden und können deren Eignung für Personal- und Ressourcenplanungsprozesse beurteilen.\n### Methodenkompetenz\n- Anforderungen an Personal- und Ressourcenplanungssysteme analysieren und überprüfbar formulieren.\n### Sozialkompetenz\n- sich im Kontext ihrer Aufgaben in das Geflecht der Beteiligten einzuordnen und mit allen Stakeholdern zusammenzuarbeiten.\n### Selbstkompetenz\n- an der Digitalisierung von Prozessen und der Weiterentwicklung von Personal- und Ressourcenplanungssystemen mitwirken.\n",
      "content": "- IT-Systeme zur Personalplanung und zum Personalcontrolling\n- Einsatz von KI im Personalmanagement\n- IT-Instrumente im Bereich des Wissensmanagements\n"
    },
    "BAPuMa_M17_U3": {
      "airtable_id": "recoPrBSCiyoUnBQN",
      "title": "Organisationstheorien und Innovation sozialer Systeme",
      "module_id": "BAPuMa_M17",
      "module_record_id": "recE2Lk1bI86jcroJ",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- grundlegende Organisationstheorien,\n- Gründe für und Ursachen von Widerständen gegen organisationale Veränderungen,\n- Bedingungen für den Erfolg organisationaler Veränderungen und\n- die Voraussetzungen von Innovationsfähigkeit und Innovationsbereitschaft in Organisationen.\n### Methodenkompetenz\nDie Studierenden\n- können Vorschläge für die Gestaltung erfolgreicher Organisationsentwicklungsprozesse entwickeln.\n### Sozialkompetenz\nDie Studierenden\n- können Ursachen und Gründe von Widerständen gegen Veränderungen reflektieren und\n- darauf aufbauend kommunikativ und kooperativ Lösungen für Widerstände in organisationalen Veränderungsprozessen entwickeln.\n### Selbstkompetenz\nDie Studierenden\n- erkennen den Nutzen von Organisationstheorien für die Analyse und Weiterentwicklung der Verwaltung an und\n- können sich in organisationalen Veränderungsprozessen in die Lage unterschiedlicher Betroffenengruppen versetzen, um deren Belange bei der Gestaltung von Veränderungen zu berücksichtigen.\n",
      "content": "- Organisationstheorien: Organisationen als rationale, soziale, offene Systeme\n- Widerstände gegen und Erfolgsfaktoren für organisationale Veränderungen\n- Innovationsfähigkeit und Innovationsbereitschaft in und von Organisationen\n"
    },
    "BAPuMa_M8_U3": {
      "airtable_id": "recpJQiBDaLQQymVf",
      "title": "Personalpsychologie II",
      "module_id": "BAPuMa_M8",
      "module_record_id": "rec4eLwdR4hMOCALc",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\nDie Studierenden\n- kennen Voraussetzungen erfolgreichen Arbeitens in Gruppen und Teams,\n- kennen sozialpsychologische Grundlagen der Arbeit in Gruppen und\n- kennen grundlegende Führungsmodelle und -theorien sowie die Wirkungen und Folgen unterschiedlichen Führungsverhaltens.\n### Methodenkompetenz\nDie Studierenden\n- können Gruppenprozesse analysieren und zielgerecht steuern und\n- können Führungsverhalten in der Praxis auf Basis ihres theoretischen Wissens beurteilen und einordnen.\n### Sozialkompetenz\nDie Studierenden\n- können in Arbeitsgruppen und Teams adäquat kommunizieren und kooperieren.\n### Selbstkompetenz\nDie Studierenden\n- können die Wirkungen ihres Handelns als Mitarbeiter\\*in und als Führungskraft reflektieren.\n",
      "content": "- Varianten, Bedingungen, Chancen und Risiken des Arbeitens in Gruppen und Teams\n- Personalführungsstile und ihre Wirkungen\n"
    },
    "BAPuMa_M15_U1": {
      "airtable_id": "recq9k6ACXndoy9Lx",
      "title": "Datenbanken (DB)",
      "module_id": "BAPuMa_M15",
      "module_record_id": "rece0marBBbivRmT5",
      "semester": 4,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n## Die Studierenden\n- sind in der Lage, an der Konzeption von Datenmodelle auf Basis konkreter Anwendungsfälle konstruktiv mitzuarbeiten,\n- kennen die auf die Modellbildung folgenden Schritte der Implementierung,\n- können Datenbankrecherchen auf verschiedenen Ebenen durchführen,\n- kennen Data-Warehouse-Konzepte als Instrumente der Datenanalyse.\n### Methodenkompetenz\nDie Studierenden\n- kennen Daten(bank)modellierungswerkzeuge und können als Anwender auch komplexe Modellbildungen nachvollziehen und beurteilen.\n### Selbstkompetenz\n- Herausforderungen in der Modellbildung einschätzen und bewerten\n- die fachspezifischen Notationen im Bereich von Datenbanken in Kooperationen mit Kolleg\\*innen sowie in der IT-Projektarbeit konstruktiv anwenden.\n",
      "content": "- Arten von Informationssystemen\n- Konzeption und Aufbau von Datenbanken\n- o Modellbildung\n- o Entwicklung von ER-Modellen\n- Implementierung von Datenbanken\n- Datenrecherche\n- o Grundlagen\n- o SQL(DML) als Instrument der Datenrecherche\n- Data Warehouse\n- o Grundlegende Funktionsweise\n- o Gegenüberstellung Datenbanken - Data Warehouse\n- o als Grundlage von Data Analytics (BI)\n"
    },
    "BAPuMa_M8_U1": {
      "airtable_id": "recsTCSsYvqwOlKoU",
      "title": "Betriebswirtschaftslehre der öffentlichen Verwaltung II (BÖV II)",
      "module_id": "BAPuMa_M8",
      "module_record_id": "rec4eLwdR4hMOCALc",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- Studierende verstehen grundlegende Herausforderungen für das leistungs- und wirkungsorientierte Verwaltungsmanagement.\n- Studierende kennen die Relevanz der Beschaffung für die öffentliche Verwaltung.\n### Methodenkompetenz\n- Leistungen und Wirkungen der Verwaltung messen und interpretieren sowie zweckmäßige Ziele formulieren und deren Erreichung überprüfen,\n- Optimierungspotenziale hinsichtlich Effizienz und Effektivität des Verwaltungshandelns identifizieren und nutzen,\n- betriebswirtschaftliche Methoden des strategischen Managements für die öffentliche Verwaltung adaptieren und zielführend anwenden.\n### Sozialkompetenz\n- Konzepte und Vorschläge zu einer modern(er)en Verwaltungssteuerung kritisch reflektieren, in Kooperation mit anderen bewerten und weiterentwickeln.\n### Selbstkompetenz\n- sich in Neues einzuarbeiten und die Bedeutung verschiedener BWL-Aspekte für ihre Aufgabenerfüllung zu bewerten,\n- wirtschaftliche  Aussagen  zum  öffentlichen  Sektor  zu  reflektieren  vor  dem  Hintergrund  seiner nachhaltigen Funktionsfähigkeit.\n",
      "content": "- Öffentliche Beschaffung\n- Erweiterung der betriebswirtschaftlichen Perspektive auf das Verwaltungshandeln\n- Grundlagen des strategischen Managements\n- Vertiefung der Kenntnisse zu ziel-, leistungs- und wirkungsorientierter Verwaltungssteuerung (Performance Management)\n"
    },
    "BAPuMa_M15_U3": {
      "airtable_id": "rectCgmzeHEUposuw",
      "title": "Prozessmanagement (PZM)",
      "module_id": "BAPuMa_M15",
      "module_record_id": "rece0marBBbivRmT5",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- verschiedene Prozesstypen,\n- die Bedeutung von Prozessen für die Wirtschaftlichkeit, Flexibilität und Qualität von Verwaltung,\n- ihre Bezüge zur Ressourcensteuerung und sind imstande, zwischen wertschöpfenden und weniger wertschöpfenden Prozessen zu unterscheiden\n- Anforderung an die Modellierung von Prozessen aus betriebswirtschaftlicher Perspektive,\n- typische Schwachstellen in (Verwaltungs)Prozessen\n### Methodenkompetenz\n- Prozesse strukturieren und an der Entwicklung von Kennzahlen für die Bewertung von Prozessen und für deren Steuerung aktiv mitwirken.\n- Prozessschwachstellen in bestehenden Prozessen identifizieren\n### Sozialkompetenz\n- mit anderen Prozessbeteiligten Schnittstellenprobleme konstruktiv zu diskutieren,\n- bei der Prozessverbesserung mit anderen Prozessbeteiligten zu kooperieren.\n### Selbstkompetenz\nDie Studierenden\n- erkennen die Bedeutung einer stellenübergreifenden Zusammenarbeit und des Schnittstellenmanagements für den Prozesserfolg,\n- erkennen den Zusammenhang von Prozessstörungen und der Neuentstehung von Prozessen (Widersprüche, Klagen, Nachbesserungen etc.)\n- sind imstande, ihr eigenes Handeln und ihre Aufgaben vor dem Hintergrund von Prozessanforderungen und störungsfreier Abläufe kritisch zu reflektieren.\n",
      "content": "- Abgrenzung unterschiedlicher Typen von Prozessen (Führung, Service, Ausführung) und Analyse ihrer Auswirkungen auf Wertschöpfung und Zusammenhänge\n- Identifikation von zentralen Geschäftsprozessen\n- Prozessdefinition, -dokumentation und -analyse\n- Ansätze der Veränderung / Neudefinition von Prozessen\n- Prozessschwächen\n- Mehrdimensionale Steuerung von Prozessen im Dienstleistungsbereich (Prozessvolumen, Ressourceneinsatz, Kosten, Dauer, Qualität)\n- Vermeidung nicht wertschöpfender Prozesse\n"
    },
    "BAPuMa_M5_U1": {
      "airtable_id": "recuUNzRo15965ibJ",
      "title": "Einführung in die Informationstechnologie (IT)",
      "module_id": "BAPuMa_M5",
      "module_record_id": "recIi7aOsHk0fb4Nh",
      "semester": 1,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Struktur eines PCs und die wichtigsten Standardanwendungen.\n### Methodenkompetenz\n- mit dem Rechner und den wichtigsten Standardanwendungen umgehen und daher häufig und wiederkehrend auftretende Arbeiten ausführen.\n- mithilfe von Kalkulationssystemen Modelle für unterschiedliche Aufgabentypen erstellen.\n### Selbstkompetenz\n- digitale Instrumente zur Arbeitsorganisation zu nutzen,\n- zu erkennen, welche der täglichen Aufgaben durch Standardanwendungen unterstützt werden können und Planungen und Kalkulationen softwareunterstützt aufzustellen,\n- sich bei Fragen zur Nutzung von Standardanwendungen selbstständig über geeignete Medien neues Wissen anzueignen.\n- eigenständig wissenschaftliche Texte mithilfe von Textverarbeitungssystemen zu erstellen.\n",
      "content": "- grundlegender Aufbau von IT-Systemen\n- IT-gestützte Arbeitsorganisation z.B. mit Outlook\n- wissenschaftliches Arbeiten mit Textverarbeitungssystemen\n- Modellbildung mit Tabellenkalkulationsprogrammen\n"
    },
    "BAPuMa_M7_U3": {
      "airtable_id": "recunYpjzCIVWrLOQ",
      "title": "Zivilrecht II",
      "module_id": "BAPuMa_M7",
      "module_record_id": "rec5UDQzlWK6DZnpE",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- die Grundbegriffe und -strukturen des Schuldrechts zu beschreiben und anzuwenden, um leichte bis mittelschwere Fälle aus diesem Bereich zu lösen,\n- die Regelungstechnik sowie wesentliche Rechtsinstitute des Schuldrechts zu erläutern,\n- Rechte und Pflichten aus Verträgen herzuleiten, Leistungsstörungen zu erkennen und diese einer Lösung zuzuführen.\n### Methodenkompetenz\n- anhand der erworbenen Strukturkenntnisse unbekannte zivilrechtliche Sachverhalte einzuordnen\n- und ggf. einer Lösung zuführen.\n### Sozialkompetenz\n- die Bedeutung des Zivilrechts für die Gesellschaft und die öffentliche Verwaltung einzuschätzen und das Zivilrecht korrekt anzuwenden,\n- Konfliktsituationen in rechtliche Formen (prozeduraler und inhaltlicher Art) zu fassen und\n- entsprechende  Konfliktlagen  letztlich  rechtlich  zutreffend,  transparent  und  für  die  Betroffenen nachvollziehbar zu entscheiden.\n### Selbstkompetenz\n- die Methoden und Techniken der Rechtsanwendung auf den Gebieten des Privatrechts in ihrer Relevanz zu erkennen und anzuwenden,\n- vorfindliche Rechtsansichten kritisch und methodengerecht zu analysieren, ggfs. zu bestätigen oder begründet und nachvollziehbar zu widerlegen.\n",
      "content": "- Grundbegriffe des allgemeinen Schuldrechts\n- Schuldverhältnis\n- Primär- und Sekundärpflichten\n- Leistungsort und Leistungszeit\n- Schuldner- und Gläubigerwechsel\n- Einwendungen und Einreden aus dem Schuldrecht\n- Leistungsstörungen wie Unmöglichkeit, Verzug und Schlechtleistung mit den daraus folgenden Konsequenzen wie Rücktritt und Schadensersatz\n- Schadensersatz\n- Ausgewählte Bereich aus dem Besonderen Schuldrecht (insb. Kaufrecht und Werkvertragsrecht)\n- Anspruchsprüfung\n"
    },
    "BAPuMa_M20I_U2": {
      "airtable_id": "recwNQVeLusFl8WAu",
      "title": "Sozialwissenschaftliche Perspektiven auf den Prozess der europäischen Integration",
      "module_id": "BAPuMa_M20I",
      "module_record_id": "rec81ZwzuJf1N0VWm",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- wesentliche Hintergründe und Entwicklungsschritte des europäischen Einigungsprozesses,\n- wichtige Institutionen und Prozesse des europäischen Mehrebenensystems und ihr Zusammenspiel,\n- unterschiedliche Formen der Europäisierung in den Nationalstaaten der Europäischen Union sowie\n- zentrale politische Handlungsfelder der Europäischen Union.\n### Methodenkompetenz\n- aktuelle politische Entwicklungen in den europäischen Gesamtkontext einordnen.\n### Sozialkompetenz\n- vor dem Hintergrund ihres Wissens unterschiedliche Perspektiven auf politische Prozesse und Entscheidungen der Europäischen Union reflektieren und kommunizieren.\n### Selbstkompetenz\nDie Studierenden\n- reflektieren strukturelle Dilemmata der europäischen Integration und\n- können europapolitische Implikationen (in) der Verwaltungsarbeit erkennen und berücksichtigen.\n",
      "content": "- historische Entwicklung des europäischen Integrationsprozesses\n- Akteure, Institutionen und Prozesse des europäischen Mehrebenensystems\n- nationalstaatliche und supranationale Entscheidungen: demokratietheoretische Probleme und strukturelle Dilemmata\n"
    },
    "BAPuMa_M4_U2": {
      "airtable_id": "recyYsNOcsmVmK1to",
      "title": "Grundlagen der Volkswirtschaftslehre und Wirtschaftspolitik II",
      "module_id": "BAPuMa_M4",
      "module_record_id": "recetQBbCUiuoQsfW",
      "semester": 2,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- grundlegende volkswirtschaftliche Zusammenhänge und wirtschaftspolitische Ansätze, insbesondere im Bereich der makroökonomischen Theorie, zu verstehen,\n- das Verhalten einzelwirtschaftlicher Akteure und die Rolle sowie Handlungsmöglichkeiten des Staates in einem makroökonomischen Kontext und damit verbundene Wechselwirkungen zu verstehen,\n- unterschiedliche Formen von Wirtschaftssystemen zu verstehen und historisch einzuordnen.\n### Methodenkompetenz\n- angemessen mit modelltheoretischen Aussagen und statistischen Kennzahlen umzugehen,\n- reale volkswirtschaftliche Sachverhalte mit abstrakten modelltheoretischen Ansätzen zu analysieren.\n### Sozialkompetenz\n- eigene Standpunkte zu formulieren und zu begründen,\n- die Komplexität volkswirtschaftlicher und wirtschaftspolitischer Zusammenhänge und damit unterschiedliche Standpunkte anzuerkennen,\n- gemeinsam mit anderen Lösungen zu erarbeiten.\n### Selbstkompetenz\n- die Aufgaben des Staates in einem gesamtwirtschaftlichen Zusammenhang zu reflektieren und diese Gesamtsicht nach außen bürgernah zu vertreten und darzustellen,\n- die Intentionen und Gründe staatlicher Aufgabenwahrnehmung sowie die Bedeutung in einer sozialen Marktwirtschaft besser zu verstehen und sind somit besser in der Lage sich mit diesen zu identifizieren.\n",
      "content": "- Wertschöpfung, Volkswirtschaftliche Gesamtrechnung und Wohlstandsmessung\n- Geld- und Währungswesen, Zentralbanken und Geldpolitik\n- Änderungen des Geldwertes und die Messung von Kaufkraft\n- Europäische Wirtschafts- und Währungsunion\n- Wirtschaftsordnung und Wirtschaftssystem\n- Konjunkturtheorie, angebots- und nachfrageorientierte Wirtschaftspolitik\n- Sozialstaat, Staatsfinanzen und Staatsverschuldung\n"
    },
    "BAPuMa_M19H_U2": {
      "airtable_id": "reczjlp846vDx1oJW",
      "title": "Rechtssoziologische Reflexionen zur Korruptionsprävention",
      "module_id": "BAPuMa_M19H",
      "module_record_id": "reclqugd7eVoTmvAC",
      "semester": 5,
      "sws": 2,
      "workload": "Präsenzstudium 34 h, Selbststudium 26 h",
      "lehrsprache": "deutsch",
      "learning_outcomes_text": "### Fachkompetenz\n- empirische und theoretische Grundlagen zur Korruption in der öffentlichen Verwaltung,\n- die begrenzten Steuerungsmöglichkeiten des Rechts bei der Korruptionsbekämpfung und\n- Methoden der Korruptionsprävention jenseits von rechtlichen Vorschriften.\n### Methodenkompetenz\n- besonders korruptionsanfällige Arbeitsbereiche der öffentlichen Verwaltung identifizieren,\n- Risikoanalysen zur Korruption erstellen und\n- je spezifische Konzepte zur Korruptionsprävention vorschlagen.\n### Sozialkompetenz\n- Korruptionsprävention mit internen und externen Kooperationspartner\\*innen reflektieren und kommunizieren.\n### Selbstkompetenz\nDie Studierenden\n- können Korruptionsrisiken in ihrem eigenen Arbeitsbereich distanziert reflektieren und\n- entwickeln eine Haltung zum offenen Umgang mit Korruption und Korruptionsrisiken.\n",
      "content": "- aktuelle Korruptionslagebilder und Korruptionstypologien\n- Ansätze zur Erklärung korrupten Handelns auf individueller und organisationaler Ebene\n- Methoden der Korruptionsprävention und ihre Wirksamkeit\n"
    }
  },
  "modules": {
    "BAPuMa_M19P": {
      "airtable_id": "rec0RrTuoPPydOzfz",
      "title": "Management- und IT-Systeme",
      "credits": 6,
      "sws": 6,
      "semester": 5,
      "gesamtziele": "Die Studierenden\n- verfügen über vertiefte fachliche und methodische Kenntnisse im Personal- und Organisationsmanagement und können in der Berufspraxis an der Entwicklung wissenschaftlich fundierter Lösungsansätze mitwirken,\n- entwickeln eine Haltung der (kontinuierlichen) Weiterentwicklung personalwirtschaftlicher und organisatorischer Lösungen und bei sich wandelnden Arbeits- und Umweltbedingungen,\n- kennen IT-Verfahren zur Unterstützung des Personal- und Organisationsmanagements.\n",
      "pruefungsleistung": "Mündliche Prüfung (PL, ca. 15 Minuten pro zu prüfender Person, Gewichtung: Unit 1: 2/3, Unit 2: 1/3)"
    },
    "BAPuMa_M20S": {
      "airtable_id": "rec3p8EUNSA8AsoFL",
      "title": "Sozialökonomische Verteilung und informationelle Teilhabe",
      "credits": 6,
      "sws": 6,
      "semester": 5,
      "gesamtziele": "Die Studierenden können\n- ökonomische und soziale Verteilungsfragen sowie deren Lösungsansätze reflektieren und kommunizieren,\n- dabei staatliches Handeln im Kontext eines marktwirtschaftlich organisierten Sozialstaates aus einer wohlfahrtsökonomischen Perspektive einordnen,\n- Zusammenhänge zwischen ökonomischen und sozialen Entwicklungen einschließlich deren räumlicher Implikationen herstellen und\n- Anforderungen an IT-Systeme im Hinblick auf Diversität identifizieren und kommunizieren.\n",
      "pruefungsleistung": "Portfolio (PL, Gewichtung: 1/3 je Unit), Details zum Portfolio werden zu Lehrveranstaltungsbeginn bekanntgegeben."
    },
    "BAPuMa_M9": {
      "airtable_id": "rec3sQTsc1Dlo1K21",
      "title": "Wahlpflichtmodul I",
      "credits": 6,
      "sws": 6,
      "semester": "",
      "gesamtziele": "Die  Studierenden  erwerben  Grundkenntnisse  in  den  belegten  rechtswissenschaftlichen,  wirtschaftswissenschaftlichen, sozialwissenschaftlichen bzw. informatikbezogenen Spezialgebieten.\n",
      "pruefungsleistung": "In jedem der drei Seminare ist ein Leistungsnachweis zu erbringen, darunter mindestens ein Leistungsnachweis in einem rechtswissenschaftlichen Seminar. Die Studierenden tragen die Verantwortung dafür, dass sie nach dem zweiten Semester über die erforderlichen Leistungsnachweise für das Modul verfügen. Mögliche Prüfungsformen (jeweils PL): Referat (schriftliche Ausarbeitung pro Person: 10.800-16.200 Zeichen, entspricht ca. 4 bis 6 Seiten), Präsentation (schriftliche Ausarbeitung pro Person: 10.80"
    },
    "BAPuMa_M8": {
      "airtable_id": "rec4eLwdR4hMOCALc",
      "title": "Verwaltungswissenschaftliche Grundlagen II",
      "credits": 6,
      "sws": 6,
      "semester": 2,
      "gesamtziele": "Die Studierenden\n- kennen individuelle und strukturelle Bedingungen des Entscheidens und Handelns (in) der Verwaltung,\n- können ihre eigenen beruflichen Handlungsmöglichkeiten erkennen und\n- können ihre Handlungsspielräume kontext- und situationsspezifisch professionell wahrnehmen.\n",
      "pruefungsleistung": "Portfolio (PL, Gewichtung: 1/3 je Unit), Details zum Lehrveranstaltungsbeginn bekanntgegeben."
    },
    "BAPuMa_M19D": {
      "airtable_id": "rec4rbFis4aFep4mv",
      "title": "Informationstechnologie und Steuerung der digitalen Transformation",
      "credits": 6,
      "sws": 6,
      "semester": 5,
      "gesamtziele": "Die Studierenden profilieren sich zum Thema Digitalisierung, indem sie\n- sich Grundlagen der Entwicklung, Bereitstellung und dem Betrieb von IT-Diensten erarbeiten,\n- strategische und operative Planungen im Kontext des IT-Einsatzes in der Verwaltung kennenlernen,\n- Herausforderungen und Ansätze zur Steuerung der digitalen Transformation kennen lernen.\n\nDie Studierenden können in Digitalisierungsprojekten mitwirken.\n",
      "pruefungsleistung": "Regelhaft: Portfolio (PL, Gewichtung: Unit zum Portfolio werden zu Lehrveranstaltungsbeginn Weitere mögliche Prüfungsformen:"
    },
    "BAPuMa_M7": {
      "airtable_id": "rec5UDQzlWK6DZnpE",
      "title": "Zivilrecht und Personalrecht",
      "credits": 8,
      "sws": 8,
      "semester": "",
      "gesamtziele": "Die Studierenden\n- überblicken die Grundstrukturen des Bürgerlichen Rechts und des Personalrechts, namentlich des Beamtenrechts,\n- sind in der Lage, fallbezogen die maßgeblichen Rechtsvorschriften zu erkennen und anzuwenden,\n- können die Methoden und Techniken der Rechtsanwendung in den genannten Rechtsbereichen anwenden.\n",
      "pruefungsleistung": "Regelhafte Prüfungsform: dreistündige Klausur am Ende des zweiten Semesters (PL, Gewichtung: 50% U1/U3 und 50% U2/U4) Weitere mögliche Prüfungsform: Take Home-Prüfung (PL)"
    },
    "BAPuMa_M20I": {
      "airtable_id": "rec81ZwzuJf1N0VWm",
      "title": "Hamburg und die Europäische Union",
      "credits": 6,
      "sws": 6,
      "semester": 5,
      "gesamtziele": "Die Studierenden\n- kennen politische und rechtliche Zusammenhänge zwischen Entscheidungen auf nationaler und supranationaler Ebene,\n- können die Einflüsse europäischen Rechts und europäischer Politik auf den eigenen Arbeitsbereich identifizieren und\n- können vor dem Hintergrund dieser Kenntnisse und Fähigkeiten Entscheidungen treffen und vertreten.\n",
      "pruefungsleistung": "Mündliche Prüfung (PL, ca. 15 Minuten pro Gewichtung: Unit 1: 2/3, Unit 2: 1/3)"
    },
    "BAPuMa_M19I": {
      "airtable_id": "recBDLpuh4HEcvtI1",
      "title": "Standort Hamburg",
      "credits": 6,
      "sws": 6,
      "semester": 5,
      "gesamtziele": "- können  ihr  Wissen  in  den  Bereichen  regional-,  und  stadtökonomischer  Grundlagen  auf  den Wirtschaftsstandort Hamburg anwenden und kennen aktuelle Strategien und Probleme zu dessen Förderung,\n- können  standortpolitische  Unternehmensentscheidungen  aus  einer  betriebswirtschaftlichen Perspektive nachvollziehen und verstehen,\n- verstehen die Bedeutung von LegalTech-Systemen als Standortfaktor und können diesbezügliche Anwendungsgebiete und Anforderungen identifizieren.\n",
      "pruefungsleistung": "Portfolio (PL, Gewichtung: Unit 1: 2/3, Portfolio werden zu Lehrveranstaltungsbeginn"
    },
    "BAPuMa_M17": {
      "airtable_id": "recE2Lk1bI86jcroJ",
      "title": "Organisation und Innovation",
      "credits": 6,
      "sws": 6,
      "semester": 5,
      "gesamtziele": "Die Studierenden\n- verstehen das grundlegende Spannungsfeld einer Organisation zwischen Stabilität und Wandel,\n- kennen Stabilität gebende organisatorische Gestaltungsparameter und Strukturmodelle mit ihren spezifischen Vor- und Nachteilen,\n- kennen Modelle und Instrumente zur Planung und Steuerung von Innovations- und Veränderungsprozessen,\n- können vor diesem Hintergrund aktuelle Ansätze reflektieren und\n- zeigen in Organisationsprojekten und Veränderungsprozessen die hierfür erforderliche Sensibilität.\n",
      "pruefungsleistung": "Portfolio (PL), Details zum Portfolio"
    },
    "BAPuMa_M19S": {
      "airtable_id": "recEcAt6TiZA6xkK7",
      "title": "Beraten, Unterstützen, Fördern und Fordern",
      "credits": 6,
      "sws": 6,
      "semester": 5,
      "gesamtziele": "- kennen die Grundlagen des Sozialrechts und können insbesondere die Regeln des SGB II und des SGB VIII erklären und anwenden,\n- können vor dem Hintergrund ihrer Kenntnisse über die soziale Lage und individuelle Probleme von Menschen, die auf staatliche Unterstützungsleistungen angewiesen sind, angemessen entscheiden und adressatengerecht kommunizieren.\n",
      "pruefungsleistung": "Mündliche Prüfung (PL, ca. 15 Minuten pro zu prüfender Person, Gewichtung: Unit 1: 2/3; Unit 2: 1/3)"
    },
    "BAPuMa_M5": {
      "airtable_id": "recIi7aOsHk0fb4Nh",
      "title": "Informationstechnische Grundlagen und Projektmanagement",
      "credits": 6,
      "sws": 6,
      "semester": "",
      "gesamtziele": "- sind vorbereitet auf Anforderungen des Studiums bei der Selbstorganisation von Projekten, der Nutzung von Standardsoftware,\n- kennen aktuelle Entwicklungen und Konzepte im Rahmen der Digitalisierung.\n",
      "pruefungsleistung": "Portfolio (PL, Gewichtung: 1/3 je Unit), Details zum Portfolio werden zu Lehrveranstaltungsbeginn bekanntgegeben."
    },
    "BAEGov_MEGov": {
      "airtable_id": "recK8Q7450VS7M950",
      "title": "",
      "credits": "",
      "sws": "",
      "semester": "",
      "gesamtziele": "",
      "pruefungsleistung": ""
    },
    "BAPuMa_M3": {
      "airtable_id": "recKXUbbqwFhedFli",
      "title": "Öffentliches Rechnungswesen",
      "credits": 8,
      "sws": 8,
      "semester": "",
      "gesamtziele": "Die Studierenden\n- verstehen Grundsystem, Bedeutung und Aufbau des öffentlichen Rechnungswesens,\n- verfügen  über  fachliche  und  methodische  Kenntnisse  in  der  Doppik  und  in  der  Kosten-  und Leistungsrechnung und können diese in der Berufspraxis anwenden und Konzepte mitgestalten,\n- können wirtschaftliche Verhaltensweisen in der Berufspraxis fördern.\n",
      "pruefungsleistung": "Regelhafte Prüfungsform: je eine zweistündige Klausur am Ende des 1. Semesters (PL, Unit 1: ÖFW I + II) und des 2. Semesters (PL, Unit 2: KLR) (Gewichtung: ½je Unit) Weitere mögliche Prüfungsform: Take Home-Prüfung (PL)"
    },
    "BAPuMa_M6": {
      "airtable_id": "recNYZE75ahBg2COj",
      "title": "Grundlagen des Öffentlichen Rechts",
      "credits": 8,
      "sws": 8,
      "semester": "",
      "gesamtziele": "Die Studierenden sind mit den wesentlichen Strukturen und Regeln des Allgemeinen Verwaltungsrechts sowie  des  Staats-  und  Europarechts  vertraut.  Die  Studierenden  sind  in  der  Lage  in  allen  genannten Gebieten einfache bis mittelschwere Fälle, die ihnen nicht bekannt sind, plausibel zu bearbeiten.\n",
      "pruefungsleistung": "Regelhafte Prüfungsform: vierstündige Klausur am Ende des zweiten Semesters (PL, Gewichtung: 50% U1/U3 und 50% U2/U4) Weitere mögliche Prüfungsform: Take Home-Prüfung (PL)"
    },
    "BAPuMa_M12": {
      "airtable_id": "recOSHMVAP0cLNY70",
      "title": "Interne und externe Ressourcensteuerung",
      "credits": 6,
      "sws": 6,
      "semester": 4,
      "gesamtziele": "- kennen die Legitimationsbasis des Haushalts für das Handeln der öffentlichen Verwaltung,\n- entwickeln Verständnis für die Bedeutung nachhaltiger Ressourcensteuerung für die Akzeptanz des öffentlichen Sektors,\n- können Ziele in verschiedenen Bereichen des politisch administrativen Systems analysieren und Zusammenhänge erkennen,\n- sind imstande, notwendige Informationen für Planungen und Entscheidungen zu erkennen und aufzubereiten,\n- kennen Herausforderungen und Anforderungen an die Rationalitätssicherung bei Investitionsvorhaben,\n- können Verfahren der dynamischen Investitionsrechnung anwenden, auf den öffentlichen Sektor anpassen und ihre Ergebnisse kontextabhängig bewerten und\n- verstehen Wechselwirkungen zwischen verschiedenen Bereichen der Ressourcensteuerung.\n",
      "pruefungsleistung": "Regelhafte Prüfungsform: 2-stündige Klausur (PL, 2/3, Unit 2: 1/3) Weitere mögliche Prüfungsform: Take Home-Prüfung"
    },
    "BAEGov_M1": {
      "airtable_id": "recPy8KdlgMFTKv5K",
      "title": "",
      "credits": "",
      "sws": "",
      "semester": "",
      "gesamtziele": "",
      "pruefungsleistung": ""
    },
    "BAPuMa_M11": {
      "airtable_id": "recSUO9D5iA47YRXs",
      "title": "Studienprojekt",
      "credits": 6,
      "sws": 4,
      "semester": "",
      "gesamtziele": "Die Studierenden erarbeiten in einem Projektteam eine komplexe Problemstellung mit Bezug zur öffentlichen Verwaltung. Sie nutzen und erweitern ihr Fachwissen und ihre Methodenkenntnisse und entwickeln auf dieser Grundlage Lösungen für eine spezifische Problemstellung aus der Berufspraxis. Sie wenden ausgewählte Projektmanagementmethoden und empirische Forschungsmethoden an, trainieren strukturiertes und konzeptionelles Denken sowie team-, aufgaben- und zielorientiertes Entscheiden und Handeln. Die  Studierenden  erweitern  ihre  Kommunikationskompetenzen  und  entwickeln  ihr  professionelles  Auftreten  weiter.  Aus  den  Projekterfahrungen  leiten  sie  projektspezifisches  und  individuelles  Weiterentwicklungspotential  ab.  Die  Studierenden  erkennen  die  Relevanz  interdisziplinären  und  forschenden Denkens für die öffentliche Verwaltung im Allgemeinen und für ihr eigenes Wirken in der Berufspraxis im Speziellen.\n",
      "pruefungsleistung": "Projektleistung (PL) gemäß § 15 Absatz 3 Nummer 8 SPO."
    },
    "BAPuMa_M20H": {
      "airtable_id": "reccwfWvbK2STQFCQ",
      "title": "Finanzwirtschaftliche Planung und Steuerung",
      "credits": 8,
      "sws": 8,
      "semester": 5,
      "gesamtziele": "- verfügen über fundierte methodische und fachliche Kenntnisse in den für das Tätigkeitsfeld der Laufbahn wesentlichen Gebieten von Haushalts- und betriebswirtschaftlicher Steuerung\n- kennen die Wechselwirkungen von Haushaltssteuerung und betriebswirtschaftlicher Steuerung und deren digitaler Umsetzung\n- sind darauf vorbereitet, Entscheidungen sachlich und rechtlich korrekt und wirtschaftlich nachhaltig zu treffen\n- kennen die Möglichkeiten und die Grenzen des Einsatzes von SAP bei ausgewählten Fragestellungen aus dem Bereich der finanzwirtschaftlichen Planung und Steuerung.\n",
      "pruefungsleistung": "Mündliche Prüfung (PL, ca. 15 Minuten pro zu prüfender Person, Gewichtung: Unit 1: ¼, Unit 2: ½, Unit 3: ¼)"
    },
    "BAPuMa_M15": {
      "airtable_id": "rece0marBBbivRmT5",
      "title": "Informations- und Prozessmanagement",
      "credits": 6,
      "sws": 6,
      "semester": "",
      "gesamtziele": "- können als Anwender komplexe Modellbildungen zur Implementierung von Datenbanken nachvollziehen und beurteilen,\n- haben grundlegende Kenntnisse über IT-Sicherheit,\n- kennen Vorgehensmodelle zur Digitalisierung von Geschäftsprozessen,\n- kennen die Bedeutung guter Prozesse für eine effektive und effiziente Verwaltung und einen nachhaltigen Umgang mit öffentlichen Ressourcen und\n- sind imstande, Prozesse so zu strukturieren, dass typische Prozessschwächen vermieden werden.\n",
      "pruefungsleistung": "Portfolio (PL, Gewichtung: 1/3 je Unit), Details zum Portfolio werden zu Lehrveranstaltungsbeginn bekanntgegeben."
    },
    "BAPuMa_M16": {
      "airtable_id": "receirLz0E0zoTzxX",
      "title": "Vertiefung im Verwaltungsrecht",
      "credits": 8,
      "sws": 8,
      "semester": "",
      "gesamtziele": "Die Studierenden kennen die Rechtsschutzmöglichkeiten von Bürger\\*innen durch den Widerspruch, die verschiedenen Klagearten sowie die einstweiligen Verfahren. Sie sind in der Lage Verwaltungsakte rechtssicher aufzuheben. Ferner haben sie sich mit drei besonderen Gebieten des Verwaltungsrechts vertraut gemacht,  nämlich  dem  Polizei-  und  Ordnungsrecht,  dem  öffentlichen  Baurecht  und  dem  Wirtschaftsverwaltungsrecht. Die Studierenden sind in der Lage, in allen genannten Gebieten mittelschwere Fälle, die ihnen nicht bekannt sind, plausibel zu bearbeiten.\n",
      "pruefungsleistung": "Regelhafte Prüfungsform: 4-stündige Klausur am Ende des 5. Semesters (PL, Gewichtung: ¼je Unit) Weitere mögliche Prüfungsform: Take Home-Prüfung (PL)"
    },
    "BAPuMa_M4": {
      "airtable_id": "recetQBbCUiuoQsfW",
      "title": "Volkswirtschaftslehre und Standortpolitik",
      "credits": 6,
      "sws": 6,
      "semester": "",
      "gesamtziele": "Die Studierenden\n- verstehen, wie der öffentliche Sektor den privaten Sektor beeinflusst und wie marktwirtschaftliche Prozesse wiederum auf staatliches Handeln wirken,\n- können wirtschaftspolitische Entscheidungen nachvollziehen und einordnen,\n- kennen Grundlagen der Regional- und Stadtökonomik und können diese bei der Beurteilung von Wirtschaftsstandorten und Standortstrategien anwenden,\n- können standortpolitische Unternehmensentscheidungen nachvollziehen und verstehen.\n",
      "pruefungsleistung": "Regelhafte Prüfungsform: 2-stündige Klausur am Ende des zweiten Semesters (PL, Gewichtung: 1/3 je Unit) Weitere mögliche Prüfungsform: Take Home-Prüfung (PL)"
    },
    "BAPuMa_M2": {
      "airtable_id": "recf9b5mBog1Zt5da",
      "title": "Methodische Grundlagen",
      "credits": 6,
      "sws": 6,
      "semester": 1,
      "gesamtziele": "Die Studierenden können\n- Rechtsfragen und Rechtsfälle methodisch plausibel bearbeiten und\n- grundlegende Methoden des wissenschaftlich-empirischen Arbeitens nutzen.\n",
      "pruefungsleistung": "Regelhafte Prüfungsform: dreistündige Klausur am Ende des 1. Semesters (PL, Gewichtung: Unit 1: 2/3, Unit 2: 1/3) Weitere mögliche Prüfungsform: Take Home-Prüfung (PL)"
    },
    "BAPuMa_M14": {
      "airtable_id": "rechEoBiLibBbh92m",
      "title": "Grundrechte und Ordnungswidrigkeitenrecht",
      "credits": 6,
      "sws": 6,
      "semester": 4,
      "gesamtziele": "Die Studierenden sind mit den Grundrechten und den Grundprinzipien des Grundgesetzes vertraut. Sie können im Rahmen des Verwaltungshandelns die Verfassungskonformität ihrer Maßnahmen beurteilen. Sie können außerdem  das  Europarecht  und  die  Gewährleistungen  der  EMRK  im  Rahmen  des  Verwaltungs-handelns anwenden und mittelschwere Fälle, die ihnen nicht bekannt sind, plausibel bearbeiten.\n",
      "pruefungsleistung": "Regelhafte Prüfungsform: 4-stündige Semesters (PL, Gewichtung 2/3 Unit 1, 1/3 Weitere mögliche Prüfungsform: Take"
    },
    "BAPuMa_M20P": {
      "airtable_id": "reciiD6VPiR3lg0s4",
      "title": "Rechtliche und sozialwissenschaftliche Aspekte von Personal und Organisation",
      "credits": 6,
      "sws": 6,
      "semester": 5,
      "gesamtziele": "- erkennen die Zusammenhänge zwischen Organisationsentwicklung, Personalentwicklung und personalrechtlichen Vorschriften,\n- überblicken die für die Personalverwaltung des öffentlichen Dienstes relevanten rechtlichen Vorschriften und kennen ausgewählte Probleme der Personalverwaltung und\n- können fallbezogen rechtlich und sozialwissenschaftlich fundierte Lösungen für Problemfälle entwickeln.\n",
      "pruefungsleistung": "Portfolio (PL, Gewichtung: 1/3 je Unit), Details zum Portfolio werden zu Lehrveranstaltungsbeginn bekanntgegeben."
    },
    "BAPuMa_M10": {
      "airtable_id": "recjDHkBLAMoSLPuO",
      "title": "Berufspraktische Studienzeit I (Orientierungsphase) - Regelstudium -",
      "credits": "",
      "sws": "",
      "semester": "",
      "gesamtziele": "",
      "pruefungsleistung": "portfolios"
    },
    "BAPuMa_M19H": {
      "airtable_id": "reclqugd7eVoTmvAC",
      "title": "Beschaffung und Vergabe: Rechtlicher Rahmen und Risiken",
      "credits": 4,
      "sws": 4,
      "semester": 5,
      "gesamtziele": "Die Studierenden\n- kennen spezifische Probleme im Kontext öffentlicher Auftragsvergabe und Beschaffung,\n- können haushalts- und vergaberechtliche sowie sonstige rechtliche Risiken identifizieren und\n- können Vorschläge zur Bearbeitung und Prävention solcher Risiken entwickeln.\n",
      "pruefungsleistung": "Fallstudie (PL, 27.000-40.500 Zeichen entspricht ca. 10-15 Seiten pro zu je Unit)"
    },
    "BAPuMa_M20D": {
      "airtable_id": "recnpLQNRghK91kWq",
      "title": "Rechtliche und gesellschaftliche Heraus- forderungen der digitalen Transformation",
      "credits": 6,
      "sws": 6,
      "semester": 5,
      "gesamtziele": "Die Studierenden\n- kennen die rechtlichen Rahmenbedingungen der behördlichen Datenverarbeitung,\n- kennen die ambivalenten Wirkungen der digitalen Transformation,\n- können Gestaltungsmöglichkeiten von Digitalisierung aus rechts- und sozialwissenschaftlicher Perspektive abwägen und\n- können vor dem Hintergrund dieser Abwägung jeweils qualifizierte Entscheidungen treffen.\n",
      "pruefungsleistung": "Mündliche Prüfung (PL, ca. 15 Minuten pro zu Gewichtung: Unit 1: 2/3, Unit 2: 1/3)"
    },
    "BAPuMa_M1": {
      "airtable_id": "recuZwpfs5f4QZRyW",
      "title": "Verwaltungswissenschaftliche Grundlagen I",
      "credits": 6,
      "sws": 6,
      "semester": 1,
      "gesamtziele": "- kennen individuelle und strukturelle Bedingungen des Entscheidens und Handelns,\n- können ihre eigenen Handlungsmöglichkeiten erkennen und\n- können ihre Handlungsspielräume kontext- und situationsspezifisch professionell wahrnehmen.\n",
      "pruefungsleistung": "Portfolio (PL, Gewichtung: 1/3 je Unit), Details Lehrveranstaltungsbeginn bekanntgegeben."
    },
    "BAPuMa_M18": {
      "airtable_id": "recun8SD5VwOd2ncV",
      "title": "Wahlpflichtmodul II",
      "credits": 4,
      "sws": 4,
      "semester": 4,
      "gesamtziele": "Die Studierenden vertiefen und erweitern ihre bereits erworbenen wissenschaftlichen Grundkenntnisse in rechtswissenschaftlichen, wirtschaftswissenschaftlichen, sozialwissenschaftlichen oder informatikbezogenen Spezialgebieten. Interdisziplinäre Bezüge sind ausdrücklich erwünscht.\n",
      "pruefungsleistung": "In jedem der zwei Seminare ist ein Leistungsnachweis zu erbringen, darunter ein Leistungsnachweis in einem rechtswissenschaftlichen Seminar. Die Studierenden tragen die Verantwortung dafür, dass sie nach dem vierten Semester über die erforderlichen Leistungsnachweise für das Modul verfügen. Mögliche Prüfungsformen (jeweils PL): Referat (schriftliche Ausarbeitung pro Person: 10.800-16.200 Zeichen, entspricht ca. 4-6 Seiten), Präsentation (schriftliche Ausarbeitung pro Person: 10.800- 16.200 Zeich"
    },
    "BAPuMa_M13": {
      "airtable_id": "recxZKUcUxaQlQkjR",
      "title": "Personalmanagement",
      "credits": 4,
      "sws": 4,
      "semester": 4,
      "gesamtziele": "Die Studierenden\n- verfügen über solide fachliche und methodische Kenntnisse im Personalmanagement und können in der Berufspraxis an der Entwicklung wissenschaftlich fundierter Lösungsansätze mitwirken und fundierte personalwirtschaftliche Entscheidungen treffen,\n- entwickeln eine Haltung der (kontinuierlichen) Weiterentwicklung personalwirtschaftlicher Fragestellungen bei sich wandelnden Arbeits- und Umweltbedingungen.\n",
      "pruefungsleistung": "Konzeptentwicklung (PL, 10.800-13.500 Zeichen pro Person, entspricht ca. vier bis fünf Seiten pro Person. Gruppenarbeit. Gewichtung: ½je Unit)"
    }
  }
}